una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/* Interrupt Priority Registers 4-7 */
typedef struct {
  __REG32  PRI_4          : 8;
  __REG32  PRI_5          : 8;
  __REG32  PRI_6          : 8;
  __REG32  PRI_7          : 8;
} __pri1_bits;

/* Interrupt Priority Registers 8-11 */
typedef struct {
  __REG32  PRI_8          : 8;
  __REG32  PRI_9          : 8;
  __REG32  PRI_10         : 8;
  __REG32  PRI_11         : 8;
} __pri2_bits;

/* Interrupt Priority Registers 12-15 */
typedef struct {
  __REG32  PRI_12         : 8;
  __REG32  PRI_13         : 8;
  __REG32  PRI_14         : 8;
  __REG32  PRI_15         : 8;
} __pri3_bits;

/* Interrupt Priority Registers 16-19 */
typedef struct {
  __REG32  PRI_16         : 8;
  __REG32  PRI_17         : 8;
  __REG32  PRI_18         : 8;
  __REG32  PRI_19         : 8;
} __pri4_bits;

/* Interrupt Priority Registers 20-23 */
typedef struct {
  __REG32  PRI_20         : 8;
  __REG32  PRI_21         : 8;
  __REG32  PRI_22         : 8;
  __REG32  PRI_23         : 8;
} __pri5_bits;

/* Interrupt Priority Registers 24-27 */
typedef struct {
  __REG32  PRI_24         : 8;
  __REG32  PRI_25         : 8;
  __REG32  PRI_26         : 8;
  __REG32  PRI_27         : 8;
} __pri6_bits;

/* Interrupt Priority Registers 28-31 */
typedef struct {
  __REG32  PRI_28         : 8;
  __REG32  PRI_29         : 8;
  __REG32  PRI_30         : 8;
  __REG32  PRI_31         : 8;
} __pri7_bits;

/* CPU ID Base Register */
typedef struct {
  __REG32  REVISION       : 4;
  __REG32  PARTNO         :12;
  __REG32  CONSTANT       : 4;
  __REG32  VARIANT        : 4;
  __REG32  IMPLEMENTER    : 8;
} __cpuidbr_bits;

/* Interrupt Control State Register */
typedef struct {
  __REG32  VECTACTIVE     : 6;
  __REG32                 : 6;
  __REG32  VECTPENDING    : 6;
  __REG32                 : 4;
  __REG32  ISRPENDING     : 1;
  __REG32                 : 2;
  __REG32  PENDSTCLR      : 1;
  __REG32  PENDSTSET      : 1;
  __REG32  PENDSVCLR      : 1;
  __REG32  PENDSVSET      : 1;
  __REG32                 : 2;
  __REG32  NMIPENDSET     : 1;
} __icsr_bits;

/* Application Interrupt and Reset Control Register */
typedef struct {
  __REG32                 : 1;
  __REG32  VECTCLRACTIVE  : 1;
  __REG32  SYSRESETREQ    : 1;
  __REG32                 :12;
  __REG32  ENDIANESS      : 1;
  __REG32  VECTKEY        :16;
} __aircr_bits;

/* System Control Register  */
typedef struct {
  __REG32                 : 1;
  __REG32  SLEEPONEXIT    : 1;
  __REG32  SLEEPDEEP      : 1;
  __REG32                 : 1;
  __REG32  SEVONPEND      : 1;
  __REG32                 :27;
} __scr_bits;

/* Configuration and Control Register */
typedef struct {
  __REG32                 : 3;
  __REG32  UNALIGN_TRP    : 1;
  __REG32                 : 4;
  __REG32  STKALIGN       : 1;
  __REG32                 :23;
} __ccr_bits;

/* Interrupt Priority Registers 8-11 */
typedef struct {
  __REG32                 :24;
  __REG32  PRI_11         : 8;
} __shpr2_bits;

/* Interrupt Priority Registers 12-15 */
typedef struct {
  __REG32                 :16;
  __REG32  PRI_14         : 8;
  __REG32  PRI_15         : 8;
} __shpr3_bits;

/* System memory remap register */
typedef struct {
  __REG32  MAP            : 2;
  __REG32                 :30;
} __sysmemremap_bits;

/* Peripheral reset control register */
typedef struct {
  __REG32  SSP0_RST_N     : 1;
  __REG32  I2C_RST_N      : 1;
  __REG32  UART0_RST_N    : 1;
  __REG32  UART1_RST_N    : 1;
  __REG32  CT16B0_RST_N   : 1;
  __REG32  CT16B1_RST_N   : 1;
  __REG32  CT32B0_RST_N   : 1;
  __REG32  CT32B1_RST_N   : 1;
  __REG32  CMP_RST_N      : 1;
  __REG32  CRC_RST_N      : 1;
  __REG32  DMA_RST_N      : 1;
  __REG32                 :21;
} __presetctrl_bits;

/* System PLL control register */
typedef struct {
  __REG32  MSEL           : 5;
  __REG32  PSEL           : 2;
  __REG32                 :25;
} __pllctrl_bits;

/* System PLL status register */
typedef struct {
  __REG32  LOCK           : 1;
  __REG32                 :31;
} __pllstat_bits;

/* System oscillator control register */
typedef struct {
  __REG32  BYPASS         : 1;
  __REG32  FREQRANGE      : 1;
  __REG32                 :30;
} __sysoscctrl_bits;

/* WatchDog oscillator control register */
typedef struct {
  __REG32  DIVSEL         : 5;
  __REG32  FREQSEL        : 4;
  __REG32                 :23;
} __wdtoscctrl_bits;

/* Internal resonant crystal control register */
typedef struct {
  __REG32  TRIM           : 8;
  __REG32                 :24;
} __ircctrl_bits;

/* RTC oscillator control register */
typedef struct {
  __REG32  RTCCLK         : 4;
  __REG32                 :28;
} __rtcoscctrl_bits;

/* System reset status register */
typedef struct {
  __REG32  POR            : 1;
  __REG32  EXTRST         : 1;
  __REG32  WDT            : 1;
  __REG32  BOD            : 1;
  __REG32  SYSRST         : 1;
  __REG32                 :27;
} __sysresstat_bits;

/* System PLL clock source select register */
/* Main clock source select register */
/* WDT clock source select register */
/* CLKOUT clock source select register */
typedef struct {
  __REG32  SEL            : 2;
  __REG32                 :30;
} __clksel_bits;

/* System PLL clock source update enable register */
/* Main clock source update enable register */
/* WDT clock source update enable register */
/* CLKOUT clock source update enable register */
typedef struct {
  __REG32  ENA            : 1;
  __REG32                 :31;
} __clkuen_bits;

/* System AHB clock divider register */
/* SSP clock divider register */
/* SYSTIC clock divider register */
/* WDT clock divider register */
/* CLKOUT clock divider register */
typedef struct {
  __REG32  DIV            : 8;
  __REG32                 :24;
} __clkdiv_bits;

/* System AHB clock control register */
typedef struct {
  __REG32  SYS            : 1;
  __REG32  ROM            : 1;
  __REG32  RAM            : 1;
  __REG32  FLASHREG       : 1;
  __REG32  FLASHARRAY     : 1;
  __REG32  I2C            : 1;
  __REG32  CRC            : 1;
  __REG32  CT16B0         : 1;
  __REG32  CT16B1         : 1;
  __REG32  CT32B0         : 1;
  __REG32  CT32B1         : 1;
  __REG32  SSP0           : 1;
  __REG32  UART0          : 1;
  __REG32  UART1          : 1;
  __REG32  ADC            : 1;
  __REG32  WDT            : 1;
  __REG32  IOCON          : 1;
  __REG32  DMA            : 1;
  __REG32                 : 1;
  __REG32  RTC            : 1;
  __REG32  CMP            : 1;
  __REG32                 : 8;
  __REG32  GPIO2          : 1;
  __REG32  GPIO1          : 1;
  __REG32  GPIO0          : 1;
} __sysahbclkctrl_bits;

/* POR captured PIO status register 0 */
typedef struct {
  __REG32  CAPPIO0_0      : 1;
  __REG32  CAPPIO0_1      : 1;
  __REG32  CAPPIO0_2      : 1;
  __REG32  CAPPIO0_3      : 1;
  __REG32  CAPPIO0_4      : 1;
  __REG32  CAPPIO0_5      : 1;
  __REG32  CAPPIO0_6      : 1;
  __REG32  CAPPIO0_7      : 1;
  __REG32  CAPPIO0_8      : 1;
  __REG32  CAPPIO0_9      : 1;
  __REG32  CAPPIO0_10     : 1;
  __REG32  CAPPIO0_11     : 1;
  __REG32  CAPPIO0_12     : 1;
  __REG32  CAPPIO0_13     : 1;
  __REG32  CAPPIO0_14     : 1;
  __REG32  CAPPIO0_15     : 1;
  __REG32  CAPPIO0_16     : 1;
  __REG32  CAPPIO0_17     : 1;
  __REG32  CAPPIO0_18     : 1;
  __REG32  CAPPIO0_19     : 1;
  __REG32  CAPPIO0_20     : 1;
  __REG32  CAPPIO0_21     : 1;
  __REG32  CAPPIO0_22     : 1;
  __REG32  CAPPIO0_23     : 1;
  __REG32  CAPPIO0_24     : 1;
  __REG32  CAPPIO0_25     : 1;
  __REG32  CAPPIO0_26     : 1;
  __REG32  CAPPIO0_27     : 1;
  __REG32  CAPPIO0_28     : 1;
  __REG32  CAPPIO0_29     : 1;
  __REG32  CAPPIO0_30     : 1;
  __REG32  CAPPIO0_31     : 1;
} __pioporcap0_bits;

