una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/* POR captured PIO status register 1 */
typedef struct {
  __REG32  CAPPIO1_0      : 1;
  __REG32  CAPPIO1_1      : 1;
  __REG32  CAPPIO1_2      : 1;
  __REG32  CAPPIO1_3      : 1;
  __REG32  CAPPIO1_4      : 1;
  __REG32  CAPPIO1_5      : 1;
  __REG32  CAPPIO1_6      : 1;
  __REG32  CAPPIO2_0      : 1;
  __REG32  CAPPIO2_1      : 1;
  __REG32  CAPPIO2_2      : 1;
  __REG32  CAPPIO2_3      : 1;
  __REG32  CAPPIO2_4      : 1;
  __REG32  CAPPIO2_5      : 1;
  __REG32  CAPPIO2_6      : 1;
  __REG32  CAPPIO2_7      : 1;
  __REG32  CAPPIO2_8      : 1;
  __REG32  CAPPIO2_9      : 1;
  __REG32  CAPPIO2_10     : 1;
  __REG32  CAPPIO2_11     : 1;
  __REG32  CAPPIO2_12     : 1;
  __REG32  CAPPIO2_13     : 1;
  __REG32  CAPPIO2_14     : 1;
  __REG32  CAPPIO2_15     : 1;
  __REG32                 : 9;
} __pioporcap1_bits;

/* BOD control register */
typedef struct {
  __REG32  BODRSTLEV      : 2;
  __REG32  BODINTVAL      : 2;
  __REG32  BODRSTENA      : 1;
  __REG32                 :27;
} __bodctrl_bits;

/* System tick timer calibration register */
typedef struct {
  __REG32  CAL            :26;
  __REG32                 : 6;
} __systckcal_bits;

/* AHB matrix master priority register */
typedef struct {
  __REG32  M0PRIO         : 2;
  __REG32  DMAPRIO        : 2;
  __REG32                 :28;
} __ahbprio_bits;

/* IRQ latency register */
typedef struct {
  __REG32  LATENCY        : 8;
  __REG32                 :24;
} __irqlatency_bits;

/* NMI interrupt source configuration register */
typedef struct {
  __REG32  NMISRC         : 6;
  __REG32                 :26;
} __intnmi_bits;

/* Start logic edge control register 0 */
typedef struct {
  __REG32  APRPIO0_0      : 1;
  __REG32  APRPIO0_1      : 1;
  __REG32  APRPIO0_2      : 1;
  __REG32  APRPIO0_3      : 1;
  __REG32  APRPIO0_4      : 1;
  __REG32  APRPIO0_5      : 1;
  __REG32  APRPIO0_6      : 1;
  __REG32  APRPIO0_7      : 1;
  __REG32  APRPIO0_8      : 1;
  __REG32  APRPIO0_9      : 1;
  __REG32  APRPIO0_10     : 1;
  __REG32  APRPIO0_11     : 1;
  __REG32                 :20;
} __start_apr_p0_bits;

/* Start logic signal enable register 0 */
typedef struct {
  __REG32  ERPIO0_0       : 1;
  __REG32  ERPIO0_1       : 1;
  __REG32  ERPIO0_2       : 1;
  __REG32  ERPIO0_3       : 1;
  __REG32  ERPIO0_4       : 1;
  __REG32  ERPIO0_5       : 1;
  __REG32  ERPIO0_6       : 1;
  __REG32  ERPIO0_7       : 1;
  __REG32  ERPIO0_8       : 1;
  __REG32  ERPIO0_9       : 1;
  __REG32  ERPIO0_10      : 1;
  __REG32  ERPIO0_11      : 1;
  __REG32                 :20;
} __start_er_p0_bits;

/* Start logic reset register 0 */
typedef struct {
  __REG32  RSRPIO0_0      : 1;
  __REG32  RSRPIO0_1      : 1;
  __REG32  RSRPIO0_2      : 1;
  __REG32  RSRPIO0_3      : 1;
  __REG32  RSRPIO0_4      : 1;
  __REG32  RSRPIO0_5      : 1;
  __REG32  RSRPIO0_6      : 1;
  __REG32  RSRPIO0_7      : 1;
  __REG32  RSRPIO0_8      : 1;
  __REG32  RSRPIO0_9      : 1;
  __REG32  RSRPIO0_10     : 1;
  __REG32  RSRPIO0_11     : 1;
  __REG32                 :20;
} __start_rsr_p0_clr_bits;

/* Start logic status register 0 */
typedef struct {
  __REG32  SRPIO0_0       : 1;
  __REG32  SRPIO0_1       : 1;
  __REG32  SRPIO0_2       : 1;
  __REG32  SRPIO0_3       : 1;
  __REG32  SRPIO0_4       : 1;
  __REG32  SRPIO0_5       : 1;
  __REG32  SRPIO0_6       : 1;
  __REG32  SRPIO0_7       : 1;
  __REG32  SRPIO0_8       : 1;
  __REG32  SRPIO0_9       : 1;
  __REG32  SRPIO0_10      : 1;
  __REG32  SRPIO0_11      : 1;
  __REG32                 :20;
} __start_sr_p0_bits;

/* Start logic edge control register 1 */
typedef struct {
  __REG32  APRINT12       : 1;
  __REG32  ARPINT13       : 1;
  __REG32  ARPINT14       : 1;
  __REG32  ARPINT15       : 1;
  __REG32  ARPINT16       : 1;
  __REG32  ARPINT17       : 1;
  __REG32  ARPINT18       : 1;
  __REG32  ARPINT19       : 1;
  __REG32  ARPINT20       : 1;
  __REG32  ARPINT21       : 1;
  __REG32  ARPINT22       : 1;
  __REG32  ARPINT23       : 1;
  __REG32  ARPINT24       : 1;
  __REG32  ARPINT25       : 1;
  __REG32  ARPINT26       : 1;
  __REG32  ARPINT27       : 1;
  __REG32  ARPINT28       : 1;
  __REG32  ARPINT29       : 1;
  __REG32  ARPINT30       : 1;
  __REG32  ARPINT31       : 1;
  __REG32                 :12;
} __start_apr_p1_bits;

/* Start logic signal enable register 1 */
typedef struct {
  __REG32  ERINT12        : 1;
  __REG32  ERINT13        : 1;
  __REG32  ERINT14        : 1;
  __REG32  ERINT15        : 1;
  __REG32  ERINT16        : 1;
  __REG32  ERINT17        : 1;
  __REG32  ERINT18        : 1;
  __REG32  ERINT19        : 1;
  __REG32  ERINT20        : 1;
  __REG32  ERINT21        : 1;
  __REG32  ERINT22        : 1;
  __REG32  ERINT23        : 1;
  __REG32  ERINT24        : 1;
  __REG32  ERINT25        : 1;
  __REG32  ERINT26        : 1;
  __REG32  ERINT27        : 1;
  __REG32  ERINT28        : 1;
  __REG32  ERINT29        : 1;
  __REG32  ERINT30        : 1;
  __REG32  ERINT31        : 1;
  __REG32                 :12;
} __start_er_p1_bits;

/* Start logic reset register 1 */
typedef struct {
  __REG32  RSRINT12       : 1;
  __REG32  RSRINT13       : 1;
  __REG32  RSRINT14       : 1;
  __REG32  RSRINT15       : 1;
  __REG32  RSRINT16       : 1;
  __REG32  RSRINT17       : 1;
  __REG32  RSRINT18       : 1;
  __REG32  RSRINT19       : 1;
  __REG32  RSRINT20       : 1;
  __REG32  RSRINT21       : 1;
  __REG32  RSRINT22       : 1;
  __REG32  RSRINT23       : 1;
  __REG32  RSRINT24       : 1;
  __REG32  RSRINT25       : 1;
  __REG32  RSRINT26       : 1;
  __REG32  RSRINT27       : 1;
  __REG32  RSRINT28       : 1;
  __REG32  RSRINT29       : 1;
  __REG32  RSRINT30       : 1;
  __REG32  RSRINT31       : 1;
  __REG32                 :12;
} __start_rsr_p1_clr_bits;

/* Start logic status register 1 */
typedef struct {
  __REG32  SRINT12        : 1;
  __REG32  SRINT13        : 1;
  __REG32  SRINT14        : 1;
  __REG32  SRINT15        : 1;
  __REG32  SRINT16        : 1;
  __REG32  SRINT17        : 1;
  __REG32  SRINT18        : 1;
  __REG32  SRINT19        : 1;
  __REG32  SRINT20        : 1;
  __REG32  SRINT21        : 1;
  __REG32  SRINT22        : 1;
  __REG32  SRINT23        : 1;
  __REG32  SRINT24        : 1;
  __REG32  SRINT25        : 1;
  __REG32  SRINT26        : 1;
  __REG32  SRINT27        : 1;
  __REG32  SRINT28        : 1;
  __REG32  SRINT29        : 1;
  __REG32  SRINT30        : 1;
  __REG32  SRINT31        : 1;
  __REG32                 :12;
} __start_sr_p1_bits;

