una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/* Deep-sleep configuration register */
typedef struct {
  __REG32  				        : 3;
  __REG32  BOD_PD         : 1;
  __REG32  								: 2;
  __REG32  WDTOSC_PD      : 1;
  __REG32                 :25;
} __pdsleepcfg_bits;

/* Power-down configuration register */
/* Wakeup configuration register */
typedef struct {
  __REG32  IRCOUT_PD      : 1;
  __REG32  IRC_PD         : 1;
  __REG32  FLASH_PD       : 1;
  __REG32  BOD_PD         : 1;
  __REG32  ADC_PD         : 1;
  __REG32  SYSOSC_PD      : 1;
  __REG32  WDTOSC_PD      : 1;
  __REG32  SYSPLL_PD      : 1;
  __REG32                 : 7;
  __REG32  COMP_PD        : 1;
  __REG32                 :16;
} __pdawakecfg_bits;

/* Power control register */
typedef struct {
  __REG32                 : 1;
  __REG32  DPDEN          : 1;
  __REG32                 : 6;
  __REG32  SLEEPFLAG      : 1;
  __REG32                 : 2;
  __REG32  DPDFLAG        : 1;
  __REG32                 :20;
} __pcon_bits;

/* GPREG4 */
typedef struct {
  __REG32                 :10;
  __REG32  WAKEUPHYS      : 1;
  __REG32  GPDATA         :21;
} __gpreg4_bits;

/* IOCON_x registers */
typedef struct {
  __REG32  FUNC           : 3;
  __REG32                 : 1;
  __REG32  MODE           : 1;
  __REG32                 : 1;
  __REG32  INV            : 1;
  __REG32  ADMODE         : 1;
  __REG32                 : 1;
  __REG32  DRV            : 1;
  __REG32  OD             : 1;
  __REG32  S_MODE         : 2;
  __REG32  CLK_DIV        : 3;
  __REG32                 :16;
} __iocon_bits;

/* IOCON_PIO0_10 register */
/* IOCON_PIO0_11 register */
typedef struct {
  __REG32  FUNC           : 3;
  __REG32                 : 3;
  __REG32  INV	          : 1;
  __REG32                 : 3;
  __REG32  TOD            : 1;
  __REG32  S_MODE         : 2;
  __REG32  CLK_DIV        : 3;
  __REG32                 :16;
} __iocon_pio0_10_bits;

/* IOCON_PIO0_0 registers */
/* IOCON_PIO0_1 registers */
/* IOCON_PIO0_2 registers */
/* IOCON_PIO0_3 registers */
/* IOCON_PIO0_4 registers */
/* IOCON_PIO0_5 registers */
/* IOCON_PIO0_6 registers */
/* IOCON_PIO0_7 registers */
/* IOCON_PIO0_8 registers */
/* IOCON_PIO0_9 registers */
/* IOCON_PIO0_12 registers */
/* IOCON_PIO0_13 registers */
/* IOCON_PIO0_14 registers */
/* IOCON_PIO0_15 registers */
/* IOCON_PIO0_16 registers */
/* IOCON_PIO0_17 registers */
/* IOCON_PIO0_18 registers */
/* IOCON_PIO0_27 registers */
/* IOCON_PIO0_28 registers */
/* IOCON_PIO0_29 registers */
/* IOCON_PIO1_6 registers */
/* IOCON_PIO2_0 registers */
/* IOCON_PIO2_1 registers */
/* IOCON_PIO2_2 registers */
/* IOCON_PIO2_3 registers */
/* IOCON_PIO2_4 registers */
/* IOCON_PIO2_5 registers */
/* IOCON_PIO2_6 registers */
/* IOCON_PIO2_7 registers */
/* IOCON_PIO2_8 registers */
/* IOCON_PIO2_9 registers */
/* IOCON_PIO2_10 registers */
/* IOCON_PIO2_11 registers */
/* IOCON_PIO2_12 registers */
/* IOCON_PIO2_13 registers */
/* IOCON_PIO2_14 registers */
/* IOCON_PIO2_15 registers */
typedef struct {
  __REG32  FUNC           : 3;
  __REG32                 : 1;
  __REG32  MODE           : 1;
  __REG32                 : 1;
  __REG32  INV            : 1;
  __REG32                 : 2;
  __REG32  DRV            : 1;
  __REG32  OD             : 1;
  __REG32  S_MODE         : 2;
  __REG32  CLK_DIV        : 3;
  __REG32                 :16;
} __iocon_pio0_27_bits;

typedef union{
  /*GPIO0MASK*/
  /*GPIO0PIN*/
  /*GPIO0OUT*/
  /*GPIO0SET*/
  /*GPIO0CLR*/
  /*GPIO0NOT*/
  /*GPIO0DIR*/
  /*GPIO0IS*/
  /*GPIO0IBE*/
  /*GPIO0IEV*/
  /*GPIO0IE*/
  /*GPIO0RIS*/
  /*GPIO0MIS*/
  /*GPIO0IC*/
  struct {
    __REG32 P0_0   : 1;
    __REG32 P0_1   : 1;
    __REG32 P0_2   : 1;
    __REG32 P0_3   : 1;
    __REG32 P0_4   : 1;
    __REG32 P0_5   : 1;
    __REG32 P0_6   : 1;
    __REG32 P0_7   : 1;
    __REG32 P0_8   : 1;
    __REG32 P0_9   : 1;
    __REG32 P0_10  : 1;
    __REG32 P0_11  : 1;
    __REG32 P0_12  : 1;
    __REG32 P0_13  : 1;
    __REG32 P0_14  : 1;
    __REG32 P0_15  : 1;
    __REG32 P0_16  : 1;
    __REG32 P0_17  : 1;
    __REG32 P0_18  : 1;
    __REG32 P0_19  : 1;
    __REG32 P0_20  : 1;
    __REG32 P0_21  : 1;
    __REG32 P0_22  : 1;
    __REG32 P0_23  : 1;
    __REG32 P0_24  : 1;
    __REG32 P0_25  : 1;
    __REG32 P0_26  : 1;
    __REG32 P0_27  : 1;
    __REG32 P0_28  : 1;
    __REG32 P0_29  : 1;
    __REG32 P0_30  : 1;
    __REG32 P0_31  : 1;
  };

  struct
  {
    union
    {
      /*GPIO0MASK0*/
      /*GPIO0PIN0*/
      /*GPIO0OUT0*/
      /*GPIO0SET0*/
      /*GPIO0CLR0*/
      /*GPIO0NOT0*/
      /*GPIO0DIR0*/
      /*GPIO0IS0*/
      /*GPIO0IBE0*/
      /*GPIO0IEV0*/
      /*GPIO0IE0*/
      /*GPIO0RIS0*/
      /*GPIO0MIS0*/
      /*GPIO0IC0*/
      struct{
        __REG8  P0_0   : 1;
        __REG8  P0_1   : 1;
        __REG8  P0_2   : 1;
        __REG8  P0_3   : 1;
        __REG8  P0_4   : 1;
        __REG8  P0_5   : 1;
        __REG8  P0_6   : 1;
        __REG8  P0_7   : 1;
      } __byte0_bit;
      __REG8 __byte0;
    };
    union
    {
      /*GPIO0MASK1*/
      /*GPIO0PIN1*/
      /*GPIO0OUT1*/
      /*GPIO0SET1*/
      /*GPIO0CLR1*/
      /*GPIO0NOT1*/
      /*GPIO0DIR1*/
      /*GPIO0IS1*/
      /*GPIO0IBE1*/
      /*GPIO0IEV1*/
      /*GPIO0IE1*/
      /*GPIO0RIS1*/
      /*GPIO0MIS1*/
      /*GPIO0IC1*/
      struct{
        __REG8  P0_0   : 1;
        __REG8  P0_1   : 1;
        __REG8  P0_2   : 1;
        __REG8  P0_3   : 1;
        __REG8  P0_4   : 1;
        __REG8  P0_5   : 1;
        __REG8  P0_6   : 1;
        __REG8  P0_7   : 1;
      } __byte1_bit;
      __REG8 __byte1;
    };
    union
    {
      /*GPIO0MASK2*/
      /*GPIO0PIN2*/
      /*GPIO0OUT2*/
      /*GPIO0SET2*/
      /*GPIO0CLR2*/
      /*GPIO0NOT2*/
      /*GPIO0DIR2*/
      /*GPIO0IS2*/
      /*GPIO0IBE2*/
      /*GPIO0IEV2*/
      /*GPIO0IE2*/
      /*GPIO0RIS2*/
      /*GPIO0MIS2*/
      /*GPIO0IC2*/
      struct{
        __REG8  P0_0   : 1;
        __REG8  P0_1   : 1;
        __REG8  P0_2   : 1;
        __REG8  P0_3   : 1;
        __REG8  P0_4   : 1;
        __REG8  P0_5   : 1;
        __REG8  P0_6   : 1;
        __REG8  P0_7   : 1;
      } __byte2_bit;
      __REG8 __byte2;
    };
    union
    {
      /*GPIO0MASK3*/
      /*GPIO0PIN3*/
      /*GPIO0OUT3*/
      /*GPIO0SET3*/
      /*GPIO0CLR3*/
      /*GPIO0NOT3*/
      /*GPIO0DIR3*/
      /*GPIO0IS3*/
      /*GPIO0IBE3*/
      /*GPIO0IEV3*/
      /*GPIO0IE3*/
      /*GPIO0RIS3*/
      /*GPIO0MIS3*/
      /*GPIO0IC3*/
      struct{
        __REG8  P0_0   : 1;
        __REG8  P0_1   : 1;
        __REG8  P0_2   : 1;
        __REG8  P0_3   : 1;
        __REG8  P0_4   : 1;
        __REG8  P0_5   : 1;
        __REG8  P0_6   : 1;
        __REG8  P0_7   : 1;
      } __byte3_bit;
      __REG8 __byte3;
    };
  };

  struct
  {
    union
    {
      /*GPIO0MASKL*/
      /*GPIO0PINL*/
      /*GPIO0OUTL*/
      /*GPIO0SETL*/
      /*GPIO0CLRL*/
      /*GPIO0NOTL*/
      /*GPIO0DIRL*/
      /*GPIO0ISL*/
      /*GPIO0IBEL*/
      /*GPIO0IEVL*/
      /*GPIO0IEL*/
      /*GPIO0RISL*/
      /*GPIO0MISL*/
      /*GPIO0ICL*/
      struct{
        __REG16 P0_0   : 1;
        __REG16 P0_1   : 1;
        __REG16 P0_2   : 1;
        __REG16 P0_3   : 1;
        __REG16 P0_4   : 1;
        __REG16 P0_5   : 1;
        __REG16 P0_6   : 1;
        __REG16 P0_7   : 1;
        __REG16 P0_8   : 1;
        __REG16 P0_9   : 1;
        __REG16 P0_10  : 1;
        __REG16 P0_11  : 1;
        __REG16 P0_12  : 1;
        __REG16 P0_13  : 1;
        __REG16 P0_14  : 1;
        __REG16 P0_15  : 1;
      } __shortl_bit;
      __REG16 __shortl;
    };
    union
    {
      /*GPIO0MASKU*/
      /*GPIO0PINU*/
      /*GPIO0OUTU*/
      /*GPIO0SETU*/
      /*GPIO0CLRU*/
      /*GPIO0NOTU*/
      /*GPIO0DIRU*/
      /*GPIO0ISU*/
      /*GPIO0IBEU*/
      /*GPIO0IEVU*/
      /*GPIO0IEU*/
      /*GPIO0RISU*/
      /*GPIO0MISU*/
      /*GPIO0ICU*/
      struct{
        __REG16 P0_0   : 1;
        __REG16 P0_1   : 1;
        __REG16 P0_2   : 1;
        __REG16 P0_3   : 1;
        __REG16 P0_4   : 1;
        __REG16 P0_5   : 1;
        __REG16 P0_6   : 1;
        __REG16 P0_7   : 1;
        __REG16 P0_8   : 1;
        __REG16 P0_9   : 1;
        __REG16 P0_10  : 1;
        __REG16 P0_11  : 1;
        __REG16 P0_12  : 1;
        __REG16 P0_13  : 1;
        __REG16 P0_14  : 1;
        __REG16 P0_15  : 1;
      } __shortu_bit;
      __REG16 __shortu;
    };
  };
} __gpio0_bits;

typedef union{
  /*GPIO1MASK*/
  /*GPIO1PIN*/
  /*GPIO1OUT*/
  /*GPIO1SET*/
  /*GPIO1CLR*/
  /*GPIO1NOT*/
  /*GPIO1DIR*/
  /*GPIO1IS*/
  /*GPIO1IBE*/
  /*GPIO1IEV*/
  /*GPIO1IE*/
  /*GPIO1RIS*/
  /*GPIO1MIS*/
  /*GPIO1IC*/
  struct {
    __REG32 P1_0   : 1;
    __REG32 P1_1   : 1;
    __REG32 P1_2   : 1;
    __REG32 P1_3   : 1;
    __REG32 P1_4   : 1;
    __REG32 P1_5   : 1;
    __REG32 P1_6   : 1;
    __REG32        :25;
  };

  struct
  {
    union
    {
      /*GPIO1MASK0*/
      /*GPIO1PIN0*/
      /*GPIO1OUT0*/
      /*GPIO1SET0*/
      /*GPIO1CLR0*/
      /*GPIO1NOT0*/
      /*GPIO1DIR0*/
      /*GPIO1IS0*/
      /*GPIO1IBE0*/
      /*GPIO1IEV0*/
      /*GPIO1IE0*/
      /*GPIO1RIS0*/
      /*GPIO1MIS0*/
      /*GPIO1IC0*/
      struct{
        __REG8  P1_0   : 1;
        __REG8  P1_1   : 1;
        __REG8  P1_2   : 1;
        __REG8  P1_3   : 1;
        __REG8  P1_4   : 1;
        __REG8  P1_5   : 1;
        __REG8  P1_6   : 1;
        __REG8         : 1;
      } __byte0_bit;
      __REG8 __byte0;
    };
    __REG8 __byte1;
    __REG8 __byte2;
    __REG8 __byte3;
  };

  struct
  {
    union
    {
      /*GPIO1MASKL*/
      /*GPIO1PINL*/
      /*GPIO1OUTL*/
      /*GPIO1SETL*/
      /*GPIO1CLRL*/
      /*GPIO1NOTL*/
      /*GPIO1DIRL*/
      /*GPIO1ISL*/
      /*GPIO1IBEL*/
      /*GPIO1IEVL*/
      /*GPIO1IEL*/
      /*GPIO1RISL*/
      /*GPIO1MISL*/
      /*GPIO1ICL*/
      struct{
        __REG16 P1_0   : 1;
        __REG16 P1_1   : 1;
        __REG16 P1_2   : 1;
        __REG16 P1_3   : 1;
        __REG16 P1_4   : 1;
        __REG16 P1_5   : 1;
        __REG16 P1_6   : 1;
        __REG16        : 9;
      } __shortl_bit;
      __REG16 __shortl;
    };
    __REG16 __shortu;
  };
} __gpio1_bits;

typedef union{
  /*GPIO2MASK*/
  /*GPIO2PIN*/
  /*GPIO2OUT*/
  /*GPIO2SET*/
  /*GPIO2CLR*/
  /*GPIO2NOT*/
  /*GPIO2DIR*/
  /*GPIO2IS*/
  /*GPIO2IBE*/
  /*GPIO2IEV*/
  /*GPIO2IE*/
  /*GPIO2RIS*/
  /*GPIO2MIS*/
  /*GPIO2IC*/
  struct {
    __REG32 P2_0   : 1;
    __REG32 P2_1   : 1;
    __REG32 P2_2   : 1;
    __REG32 P2_3   : 1;
    __REG32 P2_4   : 1;
    __REG32 P2_5   : 1;
    __REG32 P2_6   : 1;
    __REG32 P2_7   : 1;
    __REG32 P2_8   : 1;
    __REG32 P2_9   : 1;
    __REG32 P2_10  : 1;
    __REG32 P2_11  : 1;
    __REG32 P2_12  : 1;
    __REG32 P2_13  : 1;
    __REG32 P2_14  : 1;
    __REG32 P2_15  : 1;
    __REG32        :16;
  };

  struct
  {
    union
    {
      /*GPIO2MASK0*/
      /*GPIO2PIN0*/
      /*GPIO2OUT0*/
      /*GPIO2SET0*/
      /*GPIO2CLR0*/
      /*GPIO2NOT0*/
      /*GPIO2DIR0*/
      /*GPIO2IS0*/
      /*GPIO2IBE0*/
      /*GPIO2IEV0*/
      /*GPIO2IE0*/
      /*GPIO2RIS0*/
      /*GPIO2MIS0*/
      /*GPIO2IC0*/
      struct{
        __REG8  P2_0   : 1;
        __REG8  P2_1   : 1;
        __REG8  P2_2   : 1;
        __REG8  P2_3   : 1;
        __REG8  P2_4   : 1;
        __REG8  P2_5   : 1;
        __REG8  P2_6   : 1;
        __REG8  P2_7   : 1;
      } __byte0_bit;
      __REG8 __byte0;
    };
    union
    {
      /*GPIO2MASK1*/
      /*GPIO2PIN1*/
      /*GPIO2OUT1*/
      /*GPIO2SET1*/
      /*GPIO2CLR1*/
      /*GPIO2NOT1*/
      /*GPIO2DIR1*/
      /*GPIO2IS1*/
      /*GPIO2IBE1*/
      /*GPIO2IEV1*/
      /*GPIO2IE1*/
      /*GPIO2RIS1*/
      /*GPIO2MIS1*/
      /*GPIO2IC1*/
      struct{
        __REG8  P2_0   : 1;
        __REG8  P2_1   : 1;
        __REG8  P2_2   : 1;
        __REG8  P2_3   : 1;
        __REG8  P2_4   : 1;
        __REG8  P2_5   : 1;
        __REG8  P2_6   : 1;
        __REG8  P2_7   : 1;
      } __byte1_bit;
      __REG8 __byte1;
    };
    __REG8 __byte2;
    __REG8 __byte3;
  };

  struct
  {
    union
    {
      /*GPIO2MASKL*/
      /*GPIO2PINL*/
      /*GPIO2OUTL*/
      /*GPIO2SETL*/
      /*GPIO2CLRL*/
      /*GPIO2NOTL*/
      /*GPIO2DIRL*/
      /*GPIO2ISL*/
      /*GPIO2IBEL*/
      /*GPIO2IEVL*/
      /*GPIO2IEL*/
      /*GPIO2RISL*/
      /*GPIO2MISL*/
      /*GPIO2ICL*/
      struct{
        __REG16 P2_0   : 1;
        __REG16 P2_1   : 1;
        __REG16 P2_2   : 1;
        __REG16 P2_3   : 1;
        __REG16 P2_4   : 1;
        __REG16 P2_5   : 1;
        __REG16 P2_6   : 1;
        __REG16 P2_7   : 1;
        __REG16 P2_8   : 1;
        __REG16 P2_9   : 1;
        __REG16 P2_10  : 1;
        __REG16 P2_11  : 1;
        __REG16 P2_12  : 1;
        __REG16 P2_13  : 1;
        __REG16 P2_14  : 1;
        __REG16 P2_15  : 1;
      } __shortl_bit;
      __REG16 __shortl;
    };
    __REG16 __shortu;
  };
} __gpio2_bits;

/* UART interrupt enable register */
typedef struct{
__REG32 RDAIE     : 1;
__REG32 THREIE    : 1;
__REG32 RXLSIE    : 1;
__REG32           : 5;
__REG32 ABEOINTEN : 1;
__REG32 ABTOINTEN : 1;
__REG32           :22;
} __uartier_bits;

