una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/* Capture Control Register (TMR16B0CCR and TMR16B1CCR) */
/* Capture Control Register (TMR32B0CCR and TMR32B1CCR) */
typedef struct{
__REG32 CAP0RE   : 1;
__REG32 CAP0FE   : 1;
__REG32 CAP0I    : 1;
__REG32 CAP1RE   : 1;
__REG32 CAP1FE   : 1;
__REG32 CAP1I    : 1;
__REG32 CAP2RE   : 1;
__REG32 CAP2FE   : 1;
__REG32 CAP2I    : 1;
__REG32 CAP3RE   : 1;
__REG32 CAP3FE   : 1;
__REG32 CAP3I    : 1;
__REG32          :20;
} __tccr_bits;

/* External Match Register (TMR16B0EMR and TMR16B1EMR) */
/* External Match Register (TMR32B0EMR and TMR32B1EMR) */
typedef struct{
__REG32 EM0   : 1;
__REG32 EM1   : 1;
__REG32 EM2   : 1;
__REG32 EM3   : 1;
__REG32 EMC0  : 2;
__REG32 EMC1  : 2;
__REG32 EMC2  : 2;
__REG32 EMC3  : 2;
__REG32       :20;
} __emr_bits;

/* PWM Control register (TMR16B0PWMC and TMR16B1PWMC) */
/* PWM Control register (TMR32B0PWMC and TMR32B1PWMC) */
typedef struct{
__REG32 PWM0ENA  : 1;
__REG32 PWM1ENA  : 1;
__REG32 PWM2ENA  : 1;
__REG32 PWM3ENA  : 1;
__REG32          :28;
} __pwmc_bits;

/* A/D Control Register */
typedef struct{
__REG32 SEL     : 8;
__REG32 CLKDIV  : 8;
__REG32 BURST   : 1;
__REG32         : 4;
__REG32 PDN     : 1;
__REG32         : 2;
__REG32 START   : 3;
__REG32 EDGE    : 1;
__REG32         : 4;
} __adcr_bits;

/* A/D Global Data Register */
typedef struct{
__REG32         : 6;
__REG32 RESULT  :10;
__REG32         : 8;
__REG32 CHN     : 3;
__REG32         : 3;
__REG32 OVERUN  : 1;
__REG32 DONE    : 1;
} __adgdr_bits;

/* A/D Status Register */
typedef struct{
__REG32 DONE0     : 1;
__REG32 DONE1     : 1;
__REG32 DONE2     : 1;
__REG32 DONE3     : 1;
__REG32 DONE4     : 1;
__REG32 DONE5     : 1;
__REG32 DONE6     : 1;
__REG32 DONE7     : 1;
__REG32 OVERRUN0  : 1;
__REG32 OVERRUN1  : 1;
__REG32 OVERRUN2  : 1;
__REG32 OVERRUN3  : 1;
__REG32 OVERRUN4  : 1;
__REG32 OVERRUN5  : 1;
__REG32 OVERRUN6  : 1;
__REG32 OVERRUN7  : 1;
__REG32 ADINT     : 1;
__REG32           :15;
} __adstat_bits;

/* A/D Intrrupt Enable Register */
typedef struct{
__REG32 ADINTEN0  : 1;
__REG32 ADINTEN1  : 1;
__REG32 ADINTEN2  : 1;
__REG32 ADINTEN3  : 1;
__REG32 ADINTEN4  : 1;
__REG32 ADINTEN5  : 1;
__REG32 ADINTEN6  : 1;
__REG32 ADINTEN7  : 1;
__REG32 ADGINTEN  : 1;
__REG32           :23;
} __adinten_bits;

/* A/D Data Register */
typedef struct{
__REG32         : 6;
__REG32 RESULT  :10;
__REG32         :14;
__REG32 OVERUN  : 1;
__REG32 DONE    : 1;
} __addr_bits;

/* A/D Trim register */
typedef struct{
__REG32           : 4;
__REG32 ADCOFFS   : 4;
__REG32           :24;
} __adtrm_bits;

/* Watchdog mode register */
typedef struct{
__REG32 WDEN        : 1;
__REG32 WDRESET     : 1;
__REG32 WDTOF       : 1;
__REG32 WDINT       : 1;
__REG32 WDPROTECT   : 1;
__REG32 WDLOCKCLK   : 1;
__REG32 WDLOCKDP    : 1;
__REG32 WDLOCKEN    : 1;
__REG32             :24;
} __wdmod_bits;

/* Watchdog Timer Constant register */
typedef struct{
__REG32 COUNT       :24;
__REG32             : 8;
} __wdtc_bits;

/* Watchdog feed register */
typedef struct{
__REG32 FEED  : 8;
__REG32       :24;
} __wdfeed_bits;

/* Watchdog Timer Clock Source Selection Register */
typedef struct{
__REG32 WDSEL   : 2;
__REG32         :29;
__REG32 WDLOCK  : 1;
} __wdclksel_bits;

/* Watchdog Timer Warning Interrupt register */
typedef struct{
__REG32 WARNINT :10;
__REG32         :22;
} __wdwarnint_bits;

/* Watchdog Timer Window register */
typedef struct{
__REG32 WINDOW  :24;
__REG32         : 8;
} __wdwindow_bits;

/* RTC control register */
typedef struct{
__REG32 RTCSTART    : 1;
__REG32             :31;
} __rtccr_bits;

/* RTC interrupt mask set/clear register */
typedef struct{
__REG32 RTCIMSC     : 1;
__REG32             :31;
} __rtcimsc_bits;

/* RTC interrupt status register */
typedef struct{
__REG32 RTCRIS      : 1;
__REG32             :31;
} __rtcris_bits;

/* RTC masked interrupt status register */
typedef struct{
__REG32 RTCMIS      : 1;
__REG32             :31;
} __rtcmis_bits;

/* RTC interrupt clear register */
typedef struct{
__REG32 RTCICR      : 1;
__REG32             :31;
} __rtcicr_bits;

/* Comparator control register */
typedef struct{
__REG32 CMP0_EN       : 1;
__REG32 CMP1_EN       : 1;
__REG32 CMPIS         : 1;
__REG32 CMPIEV        : 1;
__REG32 CMPBE         : 1;
__REG32 CMPSR         : 1;
__REG32 CMPSA0        : 1;
__REG32 CMPSA1        : 1;
__REG32 CMP0_VP_CTRL  : 3;
__REG32 CMP0_VM_CTRL  : 3;
__REG32 CMP1_VP_CTRL  : 3;
__REG32 CMP1_VM_CTRL  : 3;
__REG32 INTCLR        : 1;
__REG32 CMP0STAT      : 1;
__REG32 CMP1STAT      : 1;
__REG32               : 9;
} __cmp_reg_bits;

/* Voltage ladder register */
typedef struct{
__REG32 VLADEN        : 1;
__REG32 VSEL          : 5;
__REG32 VLADREF       : 1;
__REG32               :25;
} __vlad_reg_bits;

/* Voltage ladder register */
typedef struct{
__REG32 CRC_POLY      : 2;
__REG32 BIT_RVS_WR    : 1;
__REG32 CMPL_WR       : 1;
__REG32 BIT_RVS_SUM   : 1;
__REG32 CMPL_SUM      : 1;
__REG32               :26;
} __crc_mode_bits;

/* DMA status register */
typedef struct{
__REG32 MASTER_EN       : 1;
__REG32                 : 3;
__REG32 STATE           : 4;
__REG32                 : 8;
__REG32 CHNLS           : 5;
__REG32                 :11;
} __dma_status_bits;

/* DMA configuration register */
typedef struct{
__REG32 MASTER_EN       : 1;
__REG32                 : 4;
__REG32 CHNL_PROT_CTRL1 : 1;
__REG32 CHNL_PROT_CTRL2 : 1;
__REG32                 :25;
} __dma_cfg_bits;

/* Channel control base pointer register */
typedef struct{
__REG32                 : 8;
__REG32 CTRL_BASE_PTR   :24;
} __ctrl_base_ptr_bits;

/* Channel wait on request status register */
/* Channel software request register */
/* Channel request mask set register */
/* Channel request mask clear register */
/* Channel enable set register */
/* Channel enable clear register */
/* Channel primary-alternate set register */
/* Channel primary-alternate clear register */
/* Channel priority set register */
/* Channel priority clear register */
/* Channel DMA interrupt status register */
/* Channel DMA interrupt enable register */
typedef struct{
__REG32 CHNL0           : 1;
__REG32 CHNL1           : 1;
__REG32 CHNL2           : 1;
__REG32 CHNL3           : 1;
__REG32 CHNL4           : 1;
__REG32 CHNL5           : 1;
__REG32 CHNL6           : 1;
__REG32 CHNL7           : 1;
__REG32 CHNL8           : 1;
__REG32 CHNL9           : 1;
__REG32 CHNL10          : 1;
__REG32 CHNL11          : 1;
__REG32 CHNL12          : 1;
__REG32 CHNL13          : 1;
__REG32 CHNL14          : 1;
__REG32 CHNL15          : 1;
__REG32 CHNL16          : 1;
__REG32 CHNL17          : 1;
__REG32 CHNL18          : 1;
__REG32 CHNL19          : 1;
__REG32 CHNL20          : 1;
__REG32                 :11;
} __chnl_bits;

