una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/* Channel useburst set register */
/* Channel useburst clear register */
typedef struct{
__REG32                 : 4;
__REG32 CHNL4           : 1;
__REG32 CHNL5           : 1;
__REG32                 :26;
} __chnl_sreq_bits;

/* Bus error clear register */
typedef struct{
__REG32 ERR_CLR         : 1;
__REG32                 :31;
} __err_clr_bits;

/* Channel control base pointer register */
typedef struct{
__REG32 IRQ_ERR_ENABLE  : 1;
__REG32                 :31;
} __irq_err_enable_bits;

#endif    /* __IAR_SYSTEMS_ICC__ */

/* Declarations common to compiler and assembler **************************/

/***************************************************************************
 **
 ** NVIC
 **
 ***************************************************************************/
__IO_REG32_BIT(SYSTICKCSR,            0xE000E010,__READ_WRITE ,__systickcsr_bits);
__IO_REG32_BIT(SYSTICKRVR,            0xE000E014,__READ_WRITE ,__systickrvr_bits);
__IO_REG32_BIT(SYSTICKCVR,            0xE000E018,__READ_WRITE ,__systickcvr_bits);
__IO_REG32_BIT(SYSTICKCALVR,          0xE000E01C,__READ       ,__systickcalvr_bits);
__IO_REG32_BIT(SETENA0,               0xE000E100,__READ_WRITE ,__setena0_bits);
#define ISER        SETENA0
#define ISER_bit    SETENA0_bit
__IO_REG32_BIT(CLRENA0,               0xE000E180,__READ_WRITE ,__clrena0_bits);
#define ICER        CLRENA0
#define ICER_bit    CLRENA0_bit
__IO_REG32_BIT(SETPEND0,              0xE000E200,__READ_WRITE ,__setpend0_bits);
#define ISPR        SETPEND0
#define ISPR_bit    SETPEND0_bit
__IO_REG32_BIT(CLRPEND0,              0xE000E280,__READ_WRITE ,__clrpend0_bits);
#define ICPR        CLRPEND0
#define ICPR_bit    CLRPEND0_bit
__IO_REG32_BIT(IP0,                   0xE000E400,__READ_WRITE ,__pri0_bits);
__IO_REG32_BIT(IP1,                   0xE000E404,__READ_WRITE ,__pri1_bits);
__IO_REG32_BIT(IP2,                   0xE000E408,__READ_WRITE ,__pri2_bits);
__IO_REG32_BIT(IP3,                   0xE000E40C,__READ_WRITE ,__pri3_bits);
__IO_REG32_BIT(IP4,                   0xE000E410,__READ_WRITE ,__pri4_bits);
__IO_REG32_BIT(IP5,                   0xE000E414,__READ_WRITE ,__pri5_bits);
__IO_REG32_BIT(IP6,                   0xE000E418,__READ_WRITE ,__pri6_bits);
__IO_REG32_BIT(IP7,                   0xE000E41C,__READ_WRITE ,__pri7_bits);
__IO_REG32_BIT(CPUIDBR,               0xE000ED00,__READ       ,__cpuidbr_bits);
#define CPUID         CPUIDBR
#define CPUID_bit     CPUIDBR_bit
__IO_REG32_BIT(ICSR,                  0xE000ED04,__READ_WRITE ,__icsr_bits);
__IO_REG32_BIT(AIRCR,                 0xE000ED0C,__READ_WRITE ,__aircr_bits);
__IO_REG32_BIT(SCR,                   0xE000ED10,__READ_WRITE ,__scr_bits);
__IO_REG32_BIT(CCR,                   0xE000ED14,__READ_WRITE ,__ccr_bits);
__IO_REG32_BIT(SHPR2,                 0xE000ED1C,__READ_WRITE ,__shpr2_bits);
__IO_REG32_BIT(SHPR3,                 0xE000ED20,__READ_WRITE ,__shpr3_bits);

/***************************************************************************
 **
 ** System control block
 **
 ***************************************************************************/
__IO_REG32_BIT(SYSMEMREMAP,           0x40048000,__READ_WRITE ,__sysmemremap_bits);
__IO_REG32_BIT(PRESETCTRL,            0x40048004,__READ_WRITE ,__presetctrl_bits);
__IO_REG32_BIT(SYSPLLCTRL,            0x40048008,__READ_WRITE ,__pllctrl_bits);
__IO_REG32_BIT(SYSPLLSTAT,            0x4004800C,__READ       ,__pllstat_bits);
__IO_REG32_BIT(SYSOSCCTRL,            0x40048020,__READ_WRITE ,__sysoscctrl_bits);
__IO_REG32_BIT(WDTOSCCTRL,            0x40048024,__READ_WRITE ,__wdtoscctrl_bits);
__IO_REG32_BIT(IRCCTRL,               0x40048028,__READ_WRITE ,__ircctrl_bits);
__IO_REG32_BIT(RTCOSCCTRL,            0x4004802C,__READ_WRITE ,__rtcoscctrl_bits);
__IO_REG32_BIT(SYSRESSTAT,            0x40048030,__READ       ,__sysresstat_bits);
__IO_REG32_BIT(SYSPLLCLKSEL,          0x40048040,__READ_WRITE ,__clksel_bits);
__IO_REG32_BIT(SYSPLLCLKUEN,          0x40048044,__READ_WRITE ,__clkuen_bits);
__IO_REG32_BIT(MAINCLKSEL,            0x40048070,__READ_WRITE ,__clksel_bits);
__IO_REG32_BIT(MAINCLKUEN,            0x40048074,__READ_WRITE ,__clkuen_bits);
__IO_REG32_BIT(SYSAHBCLKDIV,          0x40048078,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(SYSAHBCLKCTRL,         0x40048080,__READ_WRITE ,__sysahbclkctrl_bits);
__IO_REG32_BIT(SSP0CLKDIV,            0x40048094,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(UART0CLKDIV,           0x40048098,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(UART1CLKDIV,           0x4004809C,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(RTCCLKDIV,             0x400480A0,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(CLKOUTCLKSEL,          0x400480E0,__READ_WRITE ,__clksel_bits);
__IO_REG32_BIT(CLKOUTUEN,             0x400480E4,__READ_WRITE ,__clkuen_bits);
__IO_REG32_BIT(CLKOUTDIV,             0x400480E8,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(PIOPORCAP0,            0x40048100,__READ       ,__pioporcap0_bits);
__IO_REG32_BIT(PIOPORCAP1,            0x40048104,__READ       ,__pioporcap1_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV6,       0x40048134,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV5,       0x40048138,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV4,       0x4004813C,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV3,       0x40048140,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV2,       0x40048144,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV1,       0x40048148,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(IOCONFIGCLKDIV0,       0x4004814C,__READ_WRITE ,__clkdiv_bits);
__IO_REG32_BIT(BODCTRL,               0x40048150,__READ_WRITE ,__bodctrl_bits);
__IO_REG32_BIT(SYSTCKCAL,             0x40048154,__READ_WRITE ,__systckcal_bits);
__IO_REG32_BIT(AHBPRIO,               0x40048158,__READ_WRITE ,__ahbprio_bits);
__IO_REG32_BIT(IRQLATENCY,            0x40048170,__READ_WRITE ,__irqlatency_bits);
__IO_REG32_BIT(INTNMI,                0x40048174,__READ_WRITE ,__intnmi_bits);
__IO_REG32_BIT(STARTAPRP0,            0x40048200,__READ_WRITE ,__start_apr_p0_bits);
__IO_REG32_BIT(STARTERP0,             0x40048204,__READ_WRITE ,__start_er_p0_bits);
__IO_REG32_BIT(STARTRSRP0CLR,         0x40048208,__WRITE      ,__start_rsr_p0_clr_bits);
__IO_REG32_BIT(STARTSRP0,             0x4004820C,__READ       ,__start_sr_p0_bits);
__IO_REG32_BIT(STARTAPRP1,            0x40048210,__READ_WRITE ,__start_apr_p1_bits);
__IO_REG32_BIT(STARTERP1,             0x40048214,__READ_WRITE ,__start_er_p1_bits);
__IO_REG32_BIT(STARTRSRP1CLR,         0x40048218,__WRITE      ,__start_rsr_p1_clr_bits);
__IO_REG32_BIT(STARTSRP1,             0x4004821C,__READ       ,__start_sr_p1_bits);
__IO_REG32_BIT(PDSLEEPCFG,            0x40048230,__READ_WRITE ,__pdsleepcfg_bits);
__IO_REG32_BIT(PDAWAKECFG,            0x40048234,__READ_WRITE ,__pdawakecfg_bits);
__IO_REG32_BIT(PDRUNCFG,              0x40048238,__READ_WRITE ,__pdawakecfg_bits);
__IO_REG32(    DEVICE_ID,             0x400483F4,__READ       );

/***************************************************************************
 **
 ** PMU
 **
 ***************************************************************************/
__IO_REG32_BIT(PCON,                  0x40038000,__READ_WRITE ,__pcon_bits);
__IO_REG32(		 GPREG0,                0x40038004,__READ_WRITE );
__IO_REG32(		 GPREG1,                0x40038008,__READ_WRITE );
__IO_REG32(		 GPREG2,                0x4003800C,__READ_WRITE );
__IO_REG32(		 GPREG3,                0x40038010,__READ_WRITE );
__IO_REG32_BIT(GPREG4,                0x40038014,__READ_WRITE ,__gpreg4_bits);

/***************************************************************************
 **
 ** I/O configuration
 **
 ***************************************************************************/
__IO_REG32_BIT(IOCON_PIO0_19,         0x40044008,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_20,         0x4004400C,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_21,         0x40044010,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_22,         0x40044014,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_23,         0x40044018,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_24,         0x4004401C,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_25,         0x40044020,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_26,         0x40044024,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_27,         0x40044028,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_12,         0x4004402C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_13,         0x40044030,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_14,         0x40044034,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_15,         0x40044038,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_28,         0x4004403C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_29,         0x40044040,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_0,          0x40044044,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_1,          0x40044048,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_2,          0x4004404C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_3,          0x40044054,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_4,          0x40044058,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_5,          0x4004405C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_6,          0x40044060,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_7,          0x40044064,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_8,          0x40044068,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_9,          0x4004406C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_0,          0x40044070,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_1,          0x40044074,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_2,          0x40044078,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_3,          0x4004407C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_4,          0x40044080,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_5,          0x40044084,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_6,          0x40044088,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_7,          0x4004408C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_10,         0x40044090,__READ_WRITE ,__iocon_pio0_10_bits);
__IO_REG32_BIT(IOCON_PIO0_11,         0x40044094,__READ_WRITE ,__iocon_pio0_10_bits);
__IO_REG32_BIT(IOCON_PIO0_12,         0x40044098,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_13,         0x4004409C,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_14,         0x400440A0,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_15,         0x400440A4,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_16,         0x400440A8,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_17,         0x400440AC,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_18,         0x400440B0,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO0_30,         0x400440B4,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO0_31,         0x400440B8,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_0,          0x400440BC,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_1,          0x400440C0,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_2,          0x400440C4,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_3,          0x400440C8,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_4,          0x400440CC,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_5,          0x400440D0,__READ_WRITE ,__iocon_bits);
__IO_REG32_BIT(IOCON_PIO1_6,          0x400440D4,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_8,          0x400440E0,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_9,          0x400440E4,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_10,         0x400440E8,__READ_WRITE ,__iocon_pio0_27_bits);
__IO_REG32_BIT(IOCON_PIO2_11,         0x400440EC,__READ_WRITE ,__iocon_pio0_27_bits);

