una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/***************************************************************************
 **
 ** GPIO
 **
 ***************************************************************************/
__IO_REG32_BIT(GPIO0MASK,             0x50000000,__READ_WRITE ,__gpio0_bits);
#define GPIO0MASK0           GPIO0MASK_bit.__byte0
#define GPIO0MASK0_bit       GPIO0MASK_bit.__byte0_bit
#define GPIO0MASK1           GPIO0MASK_bit.__byte1
#define GPIO0MASK1_bit       GPIO0MASK_bit.__byte1_bit
#define GPIO0MASK2           GPIO0MASK_bit.__byte2
#define GPIO0MASK2_bit       GPIO0MASK_bit.__byte2_bit
#define GPIO0MASK3           GPIO0MASK_bit.__byte3
#define GPIO0MASK3_bit       GPIO0MASK_bit.__byte3_bit
#define GPIO0MASKL           GPIO0MASK_bit.__shortl
#define GPIO0MASKL_bit       GPIO0MASK_bit.__shortl_bit
#define GPIO0MASKU           GPIO0MASK_bit.__shortu
#define GPIO0MASKU_bit       GPIO0MASK_bit.__shortu_bit
__IO_REG32_BIT(GPIO0PIN,              0x50000004,__READ       ,__gpio0_bits);
#define GPIO0PIN0           GPIO0PIN_bit.__byte0
#define GPIO0PIN0_bit       GPIO0PIN_bit.__byte0_bit
#define GPIO0PIN1           GPIO0PIN_bit.__byte1
#define GPIO0PIN1_bit       GPIO0PIN_bit.__byte1_bit
#define GPIO0PIN2           GPIO0PIN_bit.__byte2
#define GPIO0PIN2_bit       GPIO0PIN_bit.__byte2_bit
#define GPIO0PIN3           GPIO0PIN_bit.__byte3
#define GPIO0PIN3_bit       GPIO0PIN_bit.__byte3_bit
#define GPIO0PINL           GPIO0PIN_bit.__shortl
#define GPIO0PINL_bit       GPIO0PIN_bit.__shortl_bit
#define GPIO0PINU           GPIO0PIN_bit.__shortu
#define GPIO0PINU_bit       GPIO0PIN_bit.__shortu_bit
__IO_REG32_BIT(GPIO0OUT,              0x50000008,__READ_WRITE ,__gpio0_bits);
#define GPIO0OUT0           GPIO0OUT_bit.__byte0
#define GPIO0OUT0_bit       GPIO0OUT_bit.__byte0_bit
#define GPIO0OUT1           GPIO0OUT_bit.__byte1
#define GPIO0OUT1_bit       GPIO0OUT_bit.__byte1_bit
#define GPIO0OUT2           GPIO0OUT_bit.__byte2
#define GPIO0OUT2_bit       GPIO0OUT_bit.__byte2_bit
#define GPIO0OUT3           GPIO0OUT_bit.__byte3
#define GPIO0OUT3_bit       GPIO0OUT_bit.__byte3_bit
#define GPIO0OUTL           GPIO0OUT_bit.__shortl
#define GPIO0OUTL_bit       GPIO0OUT_bit.__shortl_bit
#define GPIO0OUTU           GPIO0OUT_bit.__shortu
#define GPIO0OUTU_bit       GPIO0OUT_bit.__shortu_bit
__IO_REG32_BIT(GPIO0SET,              0x5000000C,__WRITE      ,__gpio0_bits);
#define GPIO0SET0           GPIO0SET_bit.__byte0
#define GPIO0SET0_bit       GPIO0SET_bit.__byte0_bit
#define GPIO0SET1           GPIO0SET_bit.__byte1
#define GPIO0SET1_bit       GPIO0SET_bit.__byte1_bit
#define GPIO0SET2           GPIO0SET_bit.__byte2
#define GPIO0SET2_bit       GPIO0SET_bit.__byte2_bit
#define GPIO0SET3           GPIO0SET_bit.__byte3
#define GPIO0SET3_bit       GPIO0SET_bit.__byte3_bit
#define GPIO0SETL           GPIO0SET_bit.__shortl
#define GPIO0SETL_bit       GPIO0SET_bit.__shortl_bit
#define GPIO0SETU           GPIO0SET_bit.__shortu
#define GPIO0SETU_bit       GPIO0SET_bit.__shortu_bit
__IO_REG32_BIT(GPIO0CLR,              0x50000010,__WRITE      ,__gpio0_bits);
#define GPIO0CLR0           GPIO0CLR_bit.__byte0
#define GPIO0CLR0_bit       GPIO0CLR_bit.__byte0_bit
#define GPIO0CLR1           GPIO0CLR_bit.__byte1
#define GPIO0CLR1_bit       GPIO0CLR_bit.__byte1_bit
#define GPIO0CLR2           GPIO0CLR_bit.__byte2
#define GPIO0CLR2_bit       GPIO0CLR_bit.__byte2_bit
#define GPIO0CLR3           GPIO0CLR_bit.__byte3
#define GPIO0CLR3_bit       GPIO0CLR_bit.__byte3_bit
#define GPIO0CLRL           GPIO0CLR_bit.__shortl
#define GPIO0CLRL_bit       GPIO0CLR_bit.__shortl_bit
#define GPIO0CLRU           GPIO0CLR_bit.__shortu
#define GPIO0CLRU_bit       GPIO0CLR_bit.__shortu_bit
__IO_REG32_BIT(GPIO0NOT,              0x50000014,__WRITE      ,__gpio0_bits);
#define GPIO0NOT0           GPIO0NOT_bit.__byte0
#define GPIO0NOT0_bit       GPIO0NOT_bit.__byte0_bit
#define GPIO0NOT1           GPIO0NOT_bit.__byte1
#define GPIO0NOT1_bit       GPIO0NOT_bit.__byte1_bit
#define GPIO0NOT2           GPIO0NOT_bit.__byte2
#define GPIO0NOT2_bit       GPIO0NOT_bit.__byte2_bit
#define GPIO0NOT3           GPIO0NOT_bit.__byte3
#define GPIO0NOT3_bit       GPIO0NOT_bit.__byte3_bit
#define GPIO0NOTL           GPIO0NOT_bit.__shortl
#define GPIO0NOTL_bit       GPIO0NOT_bit.__shortl_bit
#define GPIO0NOTU           GPIO0NOT_bit.__shortu
#define GPIO0NOTU_bit       GPIO0NOT_bit.__shortu_bit
__IO_REG32_BIT(GPIO0DIR,              0x50000020,__READ_WRITE ,__gpio0_bits);
#define GPIO0DIR0           GPIO0DIR_bit.__byte0
#define GPIO0DIR0_bit       GPIO0DIR_bit.__byte0_bit
#define GPIO0DIR1           GPIO0DIR_bit.__byte1
#define GPIO0DIR1_bit       GPIO0DIR_bit.__byte1_bit
#define GPIO0DIR2           GPIO0DIR_bit.__byte2
#define GPIO0DIR2_bit       GPIO0DIR_bit.__byte2_bit
#define GPIO0DIR3           GPIO0DIR_bit.__byte3
#define GPIO0DIR3_bit       GPIO0DIR_bit.__byte3_bit
#define GPIO0DIRL           GPIO0DIR_bit.__shortl
#define GPIO0DIRL_bit       GPIO0DIR_bit.__shortl_bit
#define GPIO0DIRU           GPIO0DIR_bit.__shortu
#define GPIO0DIRU_bit       GPIO0DIR_bit.__shortu_bit
__IO_REG32_BIT(GPIO0IS,               0x50000024,__READ_WRITE ,__gpio0_bits);
#define GPIO0IS0            GPIO0IS_bit.__byte0
#define GPIO0IS0_bit        GPIO0IS_bit.__byte0_bit
#define GPIO0IS1            GPIO0IS_bit.__byte1
#define GPIO0IS1_bit        GPIO0IS_bit.__byte1_bit
#define GPIO0IS2            GPIO0IS_bit.__byte2
#define GPIO0IS2_bit        GPIO0IS_bit.__byte2_bit
#define GPIO0IS3            GPIO0IS_bit.__byte3
#define GPIO0IS3_bit        GPIO0IS_bit.__byte3_bit
#define GPIO0ISL            GPIO0IS_bit.__shortl
#define GPIO0ISL_bit        GPIO0IS_bit.__shortl_bit
#define GPIO0ISU            GPIO0IS_bit.__shortu
#define GPIO0ISu_bit        GPIO0IS_bit.__shortu_bit
__IO_REG32_BIT(GPIO0IBE,              0x50000028,__READ_WRITE ,__gpio0_bits);
#define GPIO0IBE0           GPIO0IBE_bit.__byte0
#define GPIO0IBE0_bit       GPIO0IBE_bit.__byte0_bit
#define GPIO0IBE1           GPIO0IBE_bit.__byte1
#define GPIO0IBE1_bit       GPIO0IBE_bit.__byte1_bit
#define GPIO0IBE2           GPIO0IBE_bit.__byte2
#define GPIO0IBE2_bit       GPIO0IBE_bit.__byte2_bit
#define GPIO0IBE3           GPIO0IBE_bit.__byte3
#define GPIO0IBE3_bit       GPIO0IBE_bit.__byte3_bit
#define GPIO0IBEL           GPIO0IBE_bit.__shortl
#define GPIO0IBEL_bit       GPIO0IBE_bit.__shortl_bit
#define GPIO0IBEU           GPIO0IBE_bit.__shortu
#define GPIO0IBEU_bit       GPIO0IBE_bit.__shortu_bit
__IO_REG32_BIT(GPIO0IEV,              0x5000002C,__READ_WRITE ,__gpio0_bits);
#define GPIO0IEV0           GPIO0IEV_bit.__byte0
#define GPIO0IEV0_bit       GPIO0IEV_bit.__byte0_bit
#define GPIO0IEV1           GPIO0IEV_bit.__byte1
#define GPIO0IEV1_bit       GPIO0IEV_bit.__byte1_bit
#define GPIO0IEV2           GPIO0IEV_bit.__byte2
#define GPIO0IEV2_bit       GPIO0IEV_bit.__byte2_bit
#define GPIO0IEV3           GPIO0IEV_bit.__byte3
#define GPIO0IEV3_bit       GPIO0IEV_bit.__byte3_bit
#define GPIO0IEVL           GPIO0IEV_bit.__shortl
#define GPIO0IEVL_bit       GPIO0IEV_bit.__shortl_bit
#define GPIO0IEVU           GPIO0IEV_bit.__shortu
#define GPIO0IEVU_bit       GPIO0IEV_bit.__shortu_bit
__IO_REG32_BIT(GPIO0IE,               0x50000030,__READ_WRITE ,__gpio0_bits);
#define GPIO0IE0            GPIO0IE_bit.__byte0
#define GPIO0IE0_bit        GPIO0IE_bit.__byte0_bit
#define GPIO0IE1            GPIO0IE_bit.__byte1
#define GPIO0IE1_bit        GPIO0IE_bit.__byte1_bit
#define GPIO0IE2            GPIO0IE_bit.__byte2
#define GPIO0IE2_bit        GPIO0IE_bit.__byte2_bit
#define GPIO0IE3            GPIO0IE_bit.__byte3
#define GPIO0IE3_bit        GPIO0IE_bit.__byte3_bit
#define GPIO0IEL            GPIO0IE_bit.__shortl
#define GPIO0IEL_bit        GPIO0IE_bit.__shortl_bit
#define GPIO0IEU            GPIO0IE_bit.__shortu
#define GPIO0IEU_bit        GPIO0IE_bit.__shortu_bit
__IO_REG32_BIT(GPIO0RIS,              0x50000034,__READ       ,__gpio0_bits);
#define GPIO0RIS0           GPIO0RIS_bit.__byte0
#define GPIO0RIS0_bit       GPIO0RIS_bit.__byte0_bit
#define GPIO0RIS1           GPIO0RIS_bit.__byte1
#define GPIO0RIS1_bit       GPIO0RIS_bit.__byte1_bit
#define GPIO0RIS2           GPIO0RIS_bit.__byte2
#define GPIO0RIS2_bit       GPIO0RIS_bit.__byte2_bit
#define GPIO0RIS3           GPIO0RIS_bit.__byte3
#define GPIO0RIS3_bit       GPIO0RIS_bit.__byte3_bit
#define GPIO0RISL           GPIO0RIS_bit.__shortl
#define GPIO0RISL_bit       GPIO0RIS_bit.__shortl_bit
#define GPIO0RISU           GPIO0RIS_bit.__shortu
#define GPIO0RISU_bit       GPIO0RIS_bit.__shortu_bit
__IO_REG32_BIT(GPIO0MIS,              0x50000038,__READ       ,__gpio0_bits);
#define GPIO0MIS0           GPIO0MIS_bit.__byte0
#define GPIO0MIS0_bit       GPIO0MIS_bit.__byte0_bit
#define GPIO0MIS1           GPIO0MIS_bit.__byte1
#define GPIO0MIS1_bit       GPIO0MIS_bit.__byte1_bit
#define GPIO0MIS2           GPIO0MIS_bit.__byte2
#define GPIO0MIS2_bit       GPIO0MIS_bit.__byte2_bit
#define GPIO0MIS3           GPIO0MIS_bit.__byte3
#define GPIO0MIS3_bit       GPIO0MIS_bit.__byte3_bit
#define GPIO0MISL           GPIO0MIS_bit.__shortl
#define GPIO0MISL_bit       GPIO0MIS_bit.__shortl_bit
#define GPIO0MISU           GPIO0MIS_bit.__shortu
#define GPIO0MISU_bit       GPIO0MIS_bit.__shortu_bit
__IO_REG32_BIT(GPIO0IC,               0x5000003C,__WRITE      ,__gpio0_bits);
#define GPIO0IC0            GPIO0IC_bit.__byte0
#define GPIO0IC0_bit        GPIO0IC_bit.__byte0_bit
#define GPIO0IC1            GPIO0IC_bit.__byte1
#define GPIO0IC1_bit        GPIO0IC_bit.__byte1_bit
#define GPIO0IC2            GPIO0IC_bit.__byte2
#define GPIO0IC2_bit        GPIO0IC_bit.__byte2_bit
#define GPIO0IC3            GPIO0IC_bit.__byte3
#define GPIO0IC3_bit        GPIO0IC_bit.__byte3_bit
#define GPIO0ICL            GPIO0IC_bit.__shortl
#define GPIO0ICL_bit        GPIO0IC_bit.__shortl_bit
#define GPIO0ICU            GPIO0IC_bit.__shortu
#define GPIO0ICU_bit        GPIO0IC_bit.__shortu_bit
__IO_REG32_BIT(GPIO1MASK,             0x50010000,__READ_WRITE ,__gpio1_bits);
#define GPIO1MASK0           GPIO1MASK_bit.__byte0
#define GPIO1MASK0_bit       GPIO1MASK_bit.__byte0_bit
#define GPIO1MASKL           GPIO1MASK_bit.__shortl
#define GPIO1MASKL_bit       GPIO1MASK_bit.__shortl_bit
__IO_REG32_BIT(GPIO1PIN,              0x50010004,__READ       ,__gpio1_bits);
#define GPIO1PIN0           GPIO1PIN_bit.__byte0
#define GPIO1PIN0_bit       GPIO1PIN_bit.__byte0_bit
#define GPIO1PINL           GPIO1PIN_bit.__shortl
#define GPIO1PINL_bit       GPIO1PIN_bit.__shortl_bit
__IO_REG32_BIT(GPIO1OUT,              0x50010008,__READ_WRITE ,__gpio1_bits);
#define GPIO1OUT0           GPIO1OUT_bit.__byte0
#define GPIO1OUT0_bit       GPIO1OUT_bit.__byte0_bit
#define GPIO1OUTL           GPIO1OUT_bit.__shortl
#define GPIO1OUTL_bit       GPIO1OUT_bit.__shortl_bit
__IO_REG32_BIT(GPIO1SET,              0x5001000C,__WRITE      ,__gpio1_bits);
#define GPIO1SET0           GPIO1SET_bit.__byte0
#define GPIO1SET0_bit       GPIO1SET_bit.__byte0_bit
#define GPIO1SETL           GPIO1SET_bit.__shortl
#define GPIO1SETL_bit       GPIO1SET_bit.__shortl_bit
__IO_REG32_BIT(GPIO1CLR,              0x50010010,__WRITE      ,__gpio1_bits);
#define GPIO1CLR0           GPIO1CLR_bit.__byte0
#define GPIO1CLR0_bit       GPIO1CLR_bit.__byte0_bit
#define GPIO1CLRL           GPIO1CLR_bit.__shortl
#define GPIO1CLRL_bit       GPIO1CLR_bit.__shortl_bit
__IO_REG32_BIT(GPIO1NOT,              0x50010014,__WRITE      ,__gpio1_bits);
#define GPIO1NOT0           GPIO1NOT_bit.__byte0
#define GPIO1NOT0_bit       GPIO1NOT_bit.__byte0_bit
#define GPIO1NOTL           GPIO1NOT_bit.__shortl
#define GPIO1NOTL_bit       GPIO1NOT_bit.__shortl_bit
__IO_REG32_BIT(GPIO1DIR,              0x50010020,__READ_WRITE ,__gpio1_bits);
#define GPIO1DIR0           GPIO1DIR_bit.__byte0
#define GPIO1DIR0_bit       GPIO1DIR_bit.__byte0_bit
#define GPIO1DIRL           GPIO1DIR_bit.__shortl
#define GPIO1DIRL_bit       GPIO1DIR_bit.__shortl_bit
__IO_REG32_BIT(GPIO1IS,               0x50010024,__READ_WRITE ,__gpio1_bits);
#define GPIO1IS0            GPIO1IS_bit.__byte0
#define GPIO1IS0_bit        GPIO1IS_bit.__byte0_bit
#define GPIO1ISL            GPIO1IS_bit.__shortl
#define GPIO1ISL_bit        GPIO1IS_bit.__shortl_bit
__IO_REG32_BIT(GPIO1IBE,              0x50010028,__READ_WRITE ,__gpio1_bits);
#define GPIO1IBE0           GPIO1IBE_bit.__byte0
#define GPIO1IBE0_bit       GPIO1IBE_bit.__byte0_bit
#define GPIO1IBEL           GPIO1IBE_bit.__shortl
#define GPIO1IBEL_bit       GPIO1IBE_bit.__shortl_bit
__IO_REG32_BIT(GPIO1IEV,              0x5001002C,__READ_WRITE ,__gpio1_bits);
#define GPIO1IEV0           GPIO1IEV_bit.__byte0
#define GPIO1IEV0_bit       GPIO1IEV_bit.__byte0_bit
#define GPIO1IEVL           GPIO1IEV_bit.__shortl
#define GPIO1IEVL_bit       GPIO1IEV_bit.__shortl_bit
__IO_REG32_BIT(GPIO1IE,               0x50010030,__READ_WRITE ,__gpio1_bits);
#define GPIO1IE0            GPIO1IE_bit.__byte0
#define GPIO1IE0_bit        GPIO1IE_bit.__byte0_bit
#define GPIO1IEL            GPIO1IE_bit.__shortl
#define GPIO1IEL_bit        GPIO1IE_bit.__shortl_bit
__IO_REG32_BIT(GPIO1RIS,              0x50010034,__READ       ,__gpio1_bits);
#define GPIO1RIS0           GPIO1RIS_bit.__byte0
#define GPIO1RIS0_bit       GPIO1RIS_bit.__byte0_bit
#define GPIO1RISL           GPIO1RIS_bit.__shortl
#define GPIO1RISL_bit       GPIO1RIS_bit.__shortl_bit
__IO_REG32_BIT(GPIO1MIS,              0x50010038,__READ       ,__gpio1_bits);
#define GPIO1MIS0           GPIO1MIS_bit.__byte0
#define GPIO1MIS0_bit       GPIO1MIS_bit.__byte0_bit
#define GPIO1MISL           GPIO1MIS_bit.__shortl
#define GPIO1MISL_bit       GPIO1MIS_bit.__shortl_bit
__IO_REG32_BIT(GPIO1IC,               0x5001003C,__WRITE      ,__gpio1_bits);
#define GPIO1IC0            GPIO1IC_bit.__byte0
#define GPIO1IC0_bit        GPIO1IC_bit.__byte0_bit
#define GPIO1ICL            GPIO1IC_bit.__shortl
#define GPIO1ICL_bit        GPIO1IC_bit.__shortl_bit

__IO_REG32_BIT(GPIO2MASK,             0x50020000,__READ_WRITE ,__gpio2_bits);
#define GPIO2MASK0           GPIO2MASK_bit.__byte0
#define GPIO2MASK0_bit       GPIO2MASK_bit.__byte0_bit
#define GPIO2MASK1           GPIO2MASK_bit.__byte1
#define GPIO2MASK1_bit       GPIO2MASK_bit.__byte1_bit
#define GPIO2MASKL           GPIO2MASK_bit.__shortl
#define GPIO2MASKL_bit       GPIO2MASK_bit.__shortl_bit
__IO_REG32_BIT(GPIO2PIN,              0x50020004,__READ       ,__gpio2_bits);
#define GPIO2PIN0           GPIO2PIN_bit.__byte0
#define GPIO2PIN0_bit       GPIO2PIN_bit.__byte0_bit
#define GPIO2PIN1           GPIO2PIN_bit.__byte1
#define GPIO2PIN1_bit       GPIO2PIN_bit.__byte1_bit
#define GPIO2PINL           GPIO2PIN_bit.__shortl
#define GPIO2PINL_bit       GPIO2PIN_bit.__shortl_bit
__IO_REG32_BIT(GPIO2OUT,              0x50020008,__READ_WRITE ,__gpio2_bits);
#define GPIO2OUT0           GPIO2OUT_bit.__byte0
#define GPIO2OUT0_bit       GPIO2OUT_bit.__byte0_bit
#define GPIO2OUT1           GPIO2OUT_bit.__byte1
#define GPIO2OUT1_bit       GPIO2OUT_bit.__byte1_bit
#define GPIO2OUTL           GPIO2OUT_bit.__shortl
#define GPIO2OUTL_bit       GPIO2OUT_bit.__shortl_bit
__IO_REG32_BIT(GPIO2SET,              0x5002000C,__WRITE      ,__gpio2_bits);
#define GPIO2SET0           GPIO2SET_bit.__byte0
#define GPIO2SET0_bit       GPIO2SET_bit.__byte0_bit
#define GPIO2SET1           GPIO2SET_bit.__byte1
#define GPIO2SET1_bit       GPIO2SET_bit.__byte1_bit
#define GPIO2SETL           GPIO2SET_bit.__shortl
#define GPIO2SETL_bit       GPIO2SET_bit.__shortl_bit
__IO_REG32_BIT(GPIO2CLR,              0x50020010,__WRITE      ,__gpio2_bits);
#define GPIO2CLR0           GPIO2CLR_bit.__byte0
#define GPIO2CLR0_bit       GPIO2CLR_bit.__byte0_bit
#define GPIO2CLR1           GPIO2CLR_bit.__byte1
#define GPIO2CLR1_bit       GPIO2CLR_bit.__byte1_bit
#define GPIO2CLRL           GPIO2CLR_bit.__shortl
#define GPIO2CLRL_bit       GPIO2CLR_bit.__shortl_bit
__IO_REG32_BIT(GPIO2NOT,              0x50020014,__WRITE      ,__gpio2_bits);
#define GPIO2NOT0           GPIO2NOT_bit.__byte0
#define GPIO2NOT0_bit       GPIO2NOT_bit.__byte0_bit
#define GPIO2NOT1           GPIO2NOT_bit.__byte1
#define GPIO2NOT1_bit       GPIO2NOT_bit.__byte1_bit
#define GPIO2NOTL           GPIO2NOT_bit.__shortl
#define GPIO2NOTL_bit       GPIO2NOT_bit.__shortl_bit
__IO_REG32_BIT(GPIO2DIR,              0x50020020,__READ_WRITE ,__gpio2_bits);
#define GPIO2DIR0           GPIO2DIR_bit.__byte0
#define GPIO2DIR0_bit       GPIO2DIR_bit.__byte0_bit
#define GPIO2DIR1           GPIO2DIR_bit.__byte1
#define GPIO2DIR1_bit       GPIO2DIR_bit.__byte1_bit
#define GPIO2DIRL           GPIO2DIR_bit.__shortl
#define GPIO2DIRL_bit       GPIO2DIR_bit.__shortl_bit
__IO_REG32_BIT(GPIO2IS,               0x50020024,__READ_WRITE ,__gpio2_bits);
#define GPIO2IS0            GPIO2IS_bit.__byte0
#define GPIO2IS0_bit        GPIO2IS_bit.__byte0_bit
#define GPIO2IS1            GPIO2IS_bit.__byte1
#define GPIO2IS1_bit        GPIO2IS_bit.__byte1_bit
#define GPIO2ISL            GPIO2IS_bit.__shortl
#define GPIO2ISL_bit        GPIO2IS_bit.__shortl_bit
__IO_REG32_BIT(GPIO2IBE,              0x50020028,__READ_WRITE ,__gpio2_bits);
#define GPIO2IBE0           GPIO2IBE_bit.__byte0
#define GPIO2IBE0_bit       GPIO2IBE_bit.__byte0_bit
#define GPIO2IBE1           GPIO2IBE_bit.__byte1
#define GPIO2IBE1_bit       GPIO2IBE_bit.__byte1_bit
#define GPIO2IBEL           GPIO2IBE_bit.__shortl
#define GPIO2IBEL_bit       GPIO2IBE_bit.__shortl_bit
__IO_REG32_BIT(GPIO2IEV,              0x5002800C,__READ_WRITE ,__gpio2_bits);
#define GPIO2IEV0           GPIO2IEV_bit.__byte0
#define GPIO2IEV0_bit       GPIO2IEV_bit.__byte0_bit
#define GPIO2IEV1           GPIO2IEV_bit.__byte1
#define GPIO2IEV1_bit       GPIO2IEV_bit.__byte1_bit
#define GPIO2IEVL           GPIO2IEV_bit.__shortl
#define GPIO2IEVL_bit       GPIO2IEV_bit.__shortl_bit
__IO_REG32_BIT(GPIO2IE,               0x50020030,__READ_WRITE ,__gpio2_bits);
#define GPIO2IE0            GPIO2IE_bit.__byte0
#define GPIO2IE0_bit        GPIO2IE_bit.__byte0_bit
#define GPIO2IE1            GPIO2IE_bit.__byte1
#define GPIO2IE1_bit        GPIO2IE_bit.__byte1_bit
#define GPIO2IEL            GPIO2IE_bit.__shortl
#define GPIO2IEL_bit        GPIO2IE_bit.__shortl_bit
__IO_REG32_BIT(GPIO2RIS,              0x50020034,__READ       ,__gpio2_bits);
#define GPIO2RIS0           GPIO2RIS_bit.__byte0
#define GPIO2RIS0_bit       GPIO2RIS_bit.__byte0_bit
#define GPIO2RIS1           GPIO2RIS_bit.__byte1
#define GPIO2RIS1_bit       GPIO2RIS_bit.__byte1_bit
#define GPIO2RISL           GPIO2RIS_bit.__shortl
#define GPIO2RISL_bit       GPIO2RIS_bit.__shortl_bit
__IO_REG32_BIT(GPIO2MIS,              0x50020038,__READ       ,__gpio2_bits);
#define GPIO2MIS0           GPIO2MIS_bit.__byte0
#define GPIO2MIS0_bit       GPIO2MIS_bit.__byte0_bit
#define GPIO2MIS1           GPIO2MIS_bit.__byte1
#define GPIO2MIS1_bit       GPIO2MIS_bit.__byte1_bit
#define GPIO2MISL           GPIO2MIS_bit.__shortl
#define GPIO2MISL_bit       GPIO2MIS_bit.__shortl_bit
__IO_REG32_BIT(GPIO2IC,               0x5002003C,__WRITE      ,__gpio2_bits);
#define GPIO2IC0            GPIO2IC_bit.__byte0
#define GPIO2IC0_bit        GPIO2IC_bit.__byte0_bit
#define GPIO2IC1            GPIO2IC_bit.__byte1
#define GPIO2IC1_bit        GPIO2IC_bit.__byte1_bit
#define GPIO2ICL            GPIO2IC_bit.__shortl
#define GPIO2ICL_bit        GPIO2IC_bit.__shortl_bit

/***************************************************************************
 **
 ** UART0
 **
 ***************************************************************************/
__IO_REG8(     U0RBRTHR,              0x40008000,__READ_WRITE);
#define U0DLL U0RBRTHR
#define U0RBR U0RBRTHR
#define U0THR U0RBRTHR

/* U0DLM and U0IER share the same address */
__IO_REG32_BIT(U0IER,                 0x40008004,__READ_WRITE ,__uartier_bits);
#define U0DLM      U0IER

/* U0FCR and U0IIR share the same address */
__IO_REG32_BIT(U0FCR,                 0x40008008,__READ_WRITE ,__uartfcriir_bits);
#define U0IIR      U0FCR
#define U0IIR_bit  U0FCR_bit

__IO_REG8_BIT( U0LCR,                 0x4000800C,__READ_WRITE ,__uartlcr_bits);
__IO_REG8_BIT( U0MCR,                 0x40008010,__READ_WRITE ,__uartmcr_bits);
__IO_REG8_BIT( U0LSR,                 0x40008014,__READ       ,__uartlsr_bits);
__IO_REG8_BIT( U0MSR,                 0x40008018,__READ       ,__uartmsr_bits);
__IO_REG8(     U0SCR,                 0x4000801C,__READ_WRITE);
__IO_REG32_BIT(U0ACR,                 0x40008020,__READ_WRITE ,__uartacr_bits);
__IO_REG32_BIT(U0FDR,                 0x40008028,__READ_WRITE ,__uartfdr_bits);
__IO_REG8_BIT( U0TER,                 0x40008030,__READ_WRITE ,__uartter_bits);
__IO_REG32_BIT(U0RS485CTRL,           0x4000804C,__READ_WRITE ,__uartrs485ctrl_bits);
__IO_REG8(     U0ADRMATCH,            0x40008050,__READ_WRITE );
__IO_REG8(     U0RS485DLY,            0x40008054,__READ_WRITE );
__IO_REG32_BIT(U0FIFOLVL,             0x40008058,__READ       ,__uartfifolvl_bits);

/***************************************************************************
 **
 ** UART1
 **
 ***************************************************************************/
__IO_REG8(     U1RBRTHR,              0x4000C000,__READ_WRITE);
#define U1DLL U1RBRTHR
#define U1RBR U1RBRTHR
#define U1THR U1RBRTHR

/* U0DLM and U0IER share the same address */
__IO_REG32_BIT(U1IER,                 0x4000C004,__READ_WRITE ,__uartier_bits);
#define U1DLM      U1IER

/* U0FCR and U0IIR share the same address */
__IO_REG32_BIT(U1FCR,                 0x4000C008,__READ_WRITE ,__uartfcriir_bits);
#define U1IIR      U1FCR
#define U1IIR_bit  U1FCR_bit

__IO_REG8_BIT( U1LCR,                 0x4000C00C,__READ_WRITE ,__uartlcr_bits);
__IO_REG8_BIT( U1LSR,                 0x4000C014,__READ       ,__uartlsr_bits);
__IO_REG8(     U1SCR,                 0x4000C01C,__READ_WRITE);
__IO_REG32_BIT(U1ACR,                 0x4000C020,__READ_WRITE ,__uartacr_bits);
__IO_REG32_BIT(U1ICR,                 0x4000C024,__READ_WRITE ,__uarticr_bits);
__IO_REG32_BIT(U1FDR,                 0x4000C028,__READ_WRITE ,__uartfdr_bits);
__IO_REG8_BIT( U1TER,                 0x4000C030,__READ_WRITE ,__uartter_bits);
__IO_REG32_BIT(U1FIFOLVL,             0x4000C058,__READ       ,__uartfifolvl_bits);

/***************************************************************************
 **
 ** SSP
 **
 ***************************************************************************/
__IO_REG32_BIT(SSP0CR0,               0x40040000,__READ_WRITE ,__sspcr0_bits);
__IO_REG32_BIT(SSP0CR1,               0x40040004,__READ_WRITE ,__sspcr1_bits);
__IO_REG32_BIT(SSP0DR,                0x40040008,__READ_WRITE ,__sspdr_bits);
__IO_REG32_BIT(SSP0SR,                0x4004000C,__READ       ,__sspsr_bits);
__IO_REG32_BIT(SSP0CPSR,              0x40040010,__READ_WRITE ,__sspcpsr_bits);
__IO_REG32_BIT(SSP0IMSC,              0x40040014,__READ_WRITE ,__sspimsc_bits);
__IO_REG32_BIT(SSP0RIS,               0x40040018,__READ       ,__sspris_bits);
__IO_REG32_BIT(SSP0MIS,               0x4004001C,__READ       ,__sspmis_bits);
__IO_REG32_BIT(SSP0ICR,               0x40040020,__WRITE      ,__sspicr_bits);
__IO_REG32_BIT(SSP0DMACR,             0x40040024,__READ_WRITE ,__sspdmacr_bits);

