una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
/***************************************************************************
 **
 ** I2C
 **
 ***************************************************************************/
__IO_REG32_BIT(I2C0CONSET,            0x40000000,__READ_WRITE ,__i2conset_bits);
__IO_REG32_BIT(I2C0STAT,              0x40000004,__READ       ,__i2stat_bits);
__IO_REG32_BIT(I2C0DAT,               0x40000008,__READ_WRITE ,__i2dat_bits);
__IO_REG32_BIT(I2C0ADR,               0x4000000C,__READ_WRITE ,__i2adr_bits);
__IO_REG32_BIT(I2C0SCLH,              0x40000010,__READ_WRITE ,__i2sch_bits);
__IO_REG32_BIT(I2C0SCLL,              0x40000014,__READ_WRITE ,__i2scl_bits);
__IO_REG32_BIT(I2C0CONCLR,            0x40000018,__WRITE      ,__i2conclr_bits);
__IO_REG32_BIT(I2C0MMCTRL,            0x4000001C,__READ_WRITE ,__i2cmmctrl_bits);
__IO_REG32_BIT(I2C0ADR1,              0x40000020,__READ_WRITE ,__i2adr_bits);
__IO_REG32_BIT(I2C0ADR2,              0x40000024,__READ_WRITE ,__i2adr_bits);
__IO_REG32_BIT(I2C0ADR3,              0x40000028,__READ_WRITE ,__i2adr_bits);
__IO_REG32_BIT(I2C0DATABUFFER,        0x4000002C,__READ       ,__i2dat_bits);
__IO_REG32_BIT(I2C0MASK0,             0x40000030,__READ_WRITE ,__i2cmask_bits);
__IO_REG32_BIT(I2C0MASK1,             0x40000034,__READ_WRITE ,__i2cmask_bits);
__IO_REG32_BIT(I2C0MASK2,             0x40000038,__READ_WRITE ,__i2cmask_bits);
__IO_REG32_BIT(I2C0MASK3,             0x4000003C,__READ_WRITE ,__i2cmask_bits);

/***************************************************************************
 **
 ** CT16B0
 **
 ***************************************************************************/
__IO_REG32_BIT(TMR16B0IR,             0x40010000,__READ_WRITE ,__ir_bits);
__IO_REG32_BIT(TMR16B0TCR,            0x40010004,__READ_WRITE ,__tcr_bits);
__IO_REG16(    TMR16B0TC,             0x40010008,__READ_WRITE);
__IO_REG16(    TMR16B0PR,             0x4001000C,__READ_WRITE);
__IO_REG16(    TMR16B0PC,             0x40010010,__READ_WRITE);
__IO_REG32_BIT(TMR16B0MCR,            0x40010014,__READ_WRITE ,__mcr_bits);
__IO_REG16(    TMR16B0MR0,            0x40010018,__READ_WRITE);
__IO_REG16(    TMR16B0MR1,            0x4001001C,__READ_WRITE);
__IO_REG16(    TMR16B0MR2,            0x40010020,__READ_WRITE);
__IO_REG16(    TMR16B0MR3,            0x40010024,__READ_WRITE);
__IO_REG32_BIT(TMR16B0CCR,            0x40010028,__READ_WRITE ,__tccr_bits);
__IO_REG16(    TMR16B0CR0,            0x4001002C,__READ);
__IO_REG16(    TMR16B0CR1,            0x40010030,__READ);
__IO_REG16(    TMR16B0CR2,            0x40010034,__READ);
__IO_REG16(    TMR16B0CR3,            0x40010038,__READ);
__IO_REG32_BIT(TMR16B0EMR,            0x4001003C,__READ_WRITE ,__emr_bits);
__IO_REG32_BIT(TMR16B0CTCR,           0x40010070,__READ_WRITE ,__ctcr_bits);
__IO_REG32_BIT(TMR16B0PWMC,           0x40010074,__READ_WRITE ,__pwmc_bits);

/***************************************************************************
 **
 ** CT16B1
 **
 ***************************************************************************/
__IO_REG32_BIT(TMR16B1IR,             0x40014000,__READ_WRITE ,__ir_bits);
__IO_REG32_BIT(TMR16B1TCR,            0x40014004,__READ_WRITE ,__tcr_bits);
__IO_REG16(    TMR16B1TC,             0x40014008,__READ_WRITE);
__IO_REG16(    TMR16B1PR,             0x4001400C,__READ_WRITE);
__IO_REG16(    TMR16B1PC,             0x40014010,__READ_WRITE);
__IO_REG32_BIT(TMR16B1MCR,            0x40014014,__READ_WRITE ,__mcr_bits);
__IO_REG16(    TMR16B1MR0,            0x40014018,__READ_WRITE);
__IO_REG16(    TMR16B1MR1,            0x4001401C,__READ_WRITE);
__IO_REG16(    TMR16B1MR2,            0x40014020,__READ_WRITE);
__IO_REG16(    TMR16B1MR3,            0x40014024,__READ_WRITE);
__IO_REG32_BIT(TMR16B1CCR,            0x40014028,__READ_WRITE ,__tccr_bits);
__IO_REG16(    TMR16B1CR0,            0x4001402C,__READ);
__IO_REG16(    TMR16B1CR1,            0x40014030,__READ);
__IO_REG16(    TMR16B1CR2,            0x40014034,__READ);
__IO_REG16(    TMR16B1CR3,            0x40014038,__READ);
__IO_REG32_BIT(TMR16B1EMR,            0x4001403C,__READ_WRITE ,__emr_bits);
__IO_REG32_BIT(TMR16B1CTCR,           0x40014070,__READ_WRITE ,__ctcr_bits);
__IO_REG32_BIT(TMR16B1PWMC,           0x40014074,__READ_WRITE ,__pwmc_bits);

/***************************************************************************
 **
 ** CT32B0
 **
 ***************************************************************************/
__IO_REG32_BIT(TMR32B0IR,             0x40018000,__READ_WRITE ,__ir_bits);
__IO_REG32_BIT(TMR32B0TCR,            0x40018004,__READ_WRITE ,__tcr_bits);
__IO_REG32(    TMR32B0TC,             0x40018008,__READ_WRITE);
__IO_REG32(    TMR32B0PR,             0x4001800C,__READ_WRITE);
__IO_REG32(    TMR32B0PC,             0x40018010,__READ_WRITE);
__IO_REG32_BIT(TMR32B0MCR,            0x40018014,__READ_WRITE ,__mcr_bits);
__IO_REG32(    TMR32B0MR0,            0x40018018,__READ_WRITE);
__IO_REG32(    TMR32B0MR1,            0x4001801C,__READ_WRITE);
__IO_REG32(    TMR32B0MR2,            0x40018020,__READ_WRITE);
__IO_REG32(    TMR32B0MR3,            0x40018024,__READ_WRITE);
__IO_REG32_BIT(TMR32B0CCR,            0x40018028,__READ_WRITE ,__tccr_bits);
__IO_REG32(    TMR32B0CR0,            0x4001802C,__READ);
__IO_REG32(    TMR32B0CR1,            0x40018030,__READ);
__IO_REG32(    TMR32B0CR2,            0x40018034,__READ);
__IO_REG32(    TMR32B0CR3,            0x40018038,__READ);
__IO_REG32_BIT(TMR32B0EMR,            0x4001803C,__READ_WRITE ,__emr_bits);
__IO_REG32_BIT(TMR32B0CTCR,           0x40018070,__READ_WRITE ,__ctcr_bits);
__IO_REG32_BIT(TMR32B0PWMC,           0x40018074,__READ_WRITE ,__pwmc_bits);

/***************************************************************************
 **
 ** CT32B1
 **
 ***************************************************************************/
__IO_REG32_BIT(TMR32B1IR,             0x4001C000,__READ_WRITE ,__ir_bits);
__IO_REG32_BIT(TMR32B1TCR,            0x4001C004,__READ_WRITE ,__tcr_bits);
__IO_REG32(    TMR32B1TC,             0x4001C008,__READ_WRITE);
__IO_REG32(    TMR32B1PR,             0x4001C00C,__READ_WRITE);
__IO_REG32(    TMR32B1PC,             0x4001C010,__READ_WRITE);
__IO_REG32_BIT(TMR32B1MCR,            0x4001C014,__READ_WRITE ,__mcr_bits);
__IO_REG32(    TMR32B1MR0,            0x4001C018,__READ_WRITE);
__IO_REG32(    TMR32B1MR1,            0x4001C01C,__READ_WRITE);
__IO_REG32(    TMR32B1MR2,            0x4001C020,__READ_WRITE);
__IO_REG32(    TMR32B1MR3,            0x4001C024,__READ_WRITE);
__IO_REG32_BIT(TMR32B1CCR,            0x4001C028,__READ_WRITE ,__tccr_bits);
__IO_REG32(    TMR32B1CR0,            0x4001C02C,__READ);
__IO_REG32(    TMR32B1CR1,            0x4001C030,__READ);
__IO_REG32(    TMR32B1CR2,            0x4001C034,__READ);
__IO_REG32(    TMR32B1CR3,            0x4001C038,__READ);
__IO_REG32_BIT(TMR32B1EMR,            0x4001C03C,__READ_WRITE ,__emr_bits);
__IO_REG32_BIT(TMR32B1CTCR,           0x4001C070,__READ_WRITE ,__ctcr_bits);
__IO_REG32_BIT(TMR32B1PWMC,           0x4001C074,__READ_WRITE ,__pwmc_bits);

/***************************************************************************
 **
 ** A/D Converters
 **
 ***************************************************************************/
__IO_REG32_BIT(AD0CR,                 0x40020000,__READ_WRITE ,__adcr_bits);
__IO_REG32_BIT(AD0GDR,                0x40020004,__READ_WRITE ,__adgdr_bits);
__IO_REG32_BIT(AD0INTEN,              0x4002000C,__READ_WRITE ,__adinten_bits);
__IO_REG32_BIT(AD0DR0,                0x40020010,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR1,                0x40020014,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR2,                0x40020018,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR3,                0x4002001C,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR4,                0x40020020,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR5,                0x40020024,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR6,                0x40020028,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0DR7,                0x4002002C,__READ       ,__addr_bits);
__IO_REG32_BIT(AD0STAT,               0x40020030,__READ       ,__adstat_bits);
__IO_REG32_BIT(AD0TRM,                0x40020034,__READ_WRITE ,__adtrm_bits);

/***************************************************************************
 **
 ** Watchdog
 **
 ***************************************************************************/
__IO_REG32_BIT(WDMOD,                 0x40004000,__READ_WRITE ,__wdmod_bits);
__IO_REG32_BIT(WDTC,                  0x40004004,__READ_WRITE ,__wdtc_bits);
__IO_REG32_BIT(WDFEED,                0x40004008,__WRITE      ,__wdfeed_bits);
__IO_REG32_BIT(WDTV,                  0x4000400C,__READ       ,__wdtc_bits);
__IO_REG32_BIT(WDCLKSEL,              0x40004010,__READ_WRITE ,__wdclksel_bits);
__IO_REG32_BIT(WDWARNINT,             0x40004014,__READ_WRITE ,__wdwarnint_bits);
__IO_REG32_BIT(WDWINDOW,              0x40004018,__READ_WRITE ,__wdwindow_bits);

/***************************************************************************
 **
 ** RTC
 **
 ***************************************************************************/
__IO_REG32(    RTCDR,                 0x40050000,__READ       );
__IO_REG32(    RTCMR,                 0x40050004,__READ_WRITE );
__IO_REG32(    RTCLR,                 0x40050008,__READ_WRITE );
__IO_REG32_BIT(RTCCR,                 0x4005000C,__READ_WRITE ,__rtccr_bits);
__IO_REG32_BIT(RTCIMSC,               0x40050010,__READ_WRITE ,__rtcimsc_bits);
__IO_REG32_BIT(RTCRIS,                0x40050014,__READ_WRITE ,__rtcris_bits);
__IO_REG32_BIT(RTCMIS,                0x40050018,__READ_WRITE ,__rtcmis_bits);
__IO_REG32_BIT(RTCICR,                0x4005001C,__READ_WRITE ,__rtcicr_bits);

/***************************************************************************
 **
 ** Comparator
 **
 ***************************************************************************/
__IO_REG32_BIT(CMP_REG,               0x40054000,__READ_WRITE ,__cmp_reg_bits);
__IO_REG32_BIT(VLAD_REG,              0x40054004,__READ_WRITE ,__vlad_reg_bits);

/***************************************************************************
 **
 ** CRC
 **
 ***************************************************************************/
__IO_REG32_BIT(CRC_MODE,              0x50070000,__READ_WRITE ,__crc_mode_bits);
__IO_REG32(    CRC_SEED,              0x50070004,__READ_WRITE );
__IO_REG32(    CRC_SUM,               0x50070008,__READ_WRITE );
#define CRC_WR_DATA   CRC_SUM
__IO_REG32(    CRC_ID,                0x5007000C,__READ       );

/***************************************************************************
 **
 ** DMA
 **
 ***************************************************************************/
__IO_REG32_BIT(DMA_STATUS,            0x4004C000,__READ       ,__dma_status_bits);
__IO_REG32_BIT(DMA_CFG,               0x4004C004,__WRITE      ,__dma_cfg_bits);
__IO_REG32_BIT(CTRL_BASE_PTR,         0x4004C008,__READ_WRITE ,__ctrl_base_ptr_bits);
__IO_REG32(    ATL_CTRL_BASE_PTR,     0x4004C00C,__READ       );
__IO_REG32_BIT(DMA_WAITONREQ_STATUS,  0x4004C010,__READ       ,__chnl_bits);
__IO_REG32_BIT(CHNL_SW_REQUEST,       0x4004C014,__WRITE      ,__chnl_bits);
__IO_REG32_BIT(CHNL_USEBURST_SET,     0x4004C018,__READ_WRITE ,__chnl_sreq_bits);
__IO_REG32_BIT(CHNL_USEBURST_CLR,     0x4004C01C,__WRITE      ,__chnl_sreq_bits);
__IO_REG32_BIT(CHNL_REQ_MASK_SET,     0x4004C020,__READ_WRITE ,__chnl_bits);
__IO_REG32_BIT(CHNL_REQ_MASK_CLR,     0x4004C024,__WRITE      ,__chnl_bits);
__IO_REG32_BIT(CHNL_ENABLE_SET,       0x4004C028,__READ_WRITE ,__chnl_bits);
__IO_REG32_BIT(CHNL_ENABLE_CLR,       0x4004C02C,__WRITE      ,__chnl_bits);
__IO_REG32_BIT(CHNL_PRI_ALT_SET,      0x4004C030,__READ_WRITE ,__chnl_bits);
__IO_REG32_BIT(CHNL_PRI_ALT_CLR,      0x4004C034,__WRITE      ,__chnl_bits);
__IO_REG32_BIT(CHNL_PRIORITY_SET,     0x4004C038,__READ_WRITE ,__chnl_bits);
__IO_REG32_BIT(CHNL_PRIORITY_CLR,     0x4004C03C,__WRITE      ,__chnl_bits);
__IO_REG32_BIT(ERR_CLR,               0x4004C04C,__READ_WRITE ,__err_clr_bits);
__IO_REG32_BIT(CHNL_IRQ_STATUS,       0x4004C080,__READ_WRITE ,__chnl_bits);
__IO_REG32_BIT(IRQ_ERR_ENABLE,        0x4004C084,__READ_WRITE ,__irq_err_enable_bits);
__IO_REG32_BIT(CHNL_IRQ_ENABLE,       0x4004C088,__READ_WRITE ,__chnl_bits);

/***************************************************************************
 **  Assembler-specific declarations
 ***************************************************************************/

