una1veritas/Workspace/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc1224.h
#ifdef __IAR_SYSTEMS_ASM__
#endif    /* __IAR_SYSTEMS_ASM__ */

/***************************************************************************
 **
 ** DMA Controller peripheral devices lines
 **
 ***************************************************************************/
#define DMA_UART0TX            0   /* UART0 Tx                                 */
#define DMA_UART0RX            1   /* UART0 Rx                                 */
#define DMA_UART1TX            2   /* UART1 Tx                                 */
#define DMA_UART1RX            3   /* UART1 Rx                                 */
#define DMA_SSP0TX             4   /* SSP Tx                                   */
#define DMA_SSP0RX             5   /* SSP Rx                                   */
#define DMA_ADC                6   /* ADC                                      */
#define DMA_RTC                7   /* RTC                                      */
#define DMA_CT32B0MTCH0        8   /* 32-bit Timer 0 match 0                   */
#define DMA_CT32B0MTCH1        9   /* 32-bit Timer 0 match 1                   */
#define DMA_CT32B1MTCH0       10   /* 32-bit Timer 1 match 0                   */
#define DMA_CT32B1MTCH1       11   /* 32-bit Timer 1 match 1                   */
#define DMA_CT16B0MTCH0       12   /* 16-bit Timer 0 match 0                   */
#define DMA_CT16B1MTCH0       13   /* 16-bit Timer 1 match 0                   */
#define DMA_CMP0              14   /* Comparator 0                             */
#define DMA_CMP1              15   /* Comparator 1                             */
#define DMA_PIO0              16   /* PIO 0                                    */
#define DMA_PIO1              17   /* PIO 1                                    */
#define DMA_PIO2              18   /* PIO 2                                    */

/***************************************************************************
 **
 **  NVIC Interrupt channels
 **
 ***************************************************************************/
#define MAIN_STACK             0  /* Main Stack                                             */
#define RESETI                 1  /* Reset                                                  */
#define NMII                   2  /* Non-maskable Interrupt                                 */
#define HFI                    3  /* Hard Fault                                             */
#define MMI                    4  /* Memory Management                                      */
#define BFI                    5  /* Bus Fault                                              */
#define UFI                    6  /* Usage Fault                                            */
#define SVCI                  11  /* SVCall                                                 */
#define DMI                   12  /* Debug Monitor                                          */
#define PSI                   14  /* PendSV                                                 */
#define STI                   15  /* SysTick                                                */
#define NVIC_WAKE_UP0         16  /* Wake Up Interrupt 0                                    */
#define NVIC_WAKE_UP1         17  /* Wake Up Interrupt 1                                    */
#define NVIC_WAKE_UP2         18  /* Wake Up Interrupt 2                                    */
#define NVIC_WAKE_UP3         19  /* Wake Up Interrupt 3                                    */
#define NVIC_WAKE_UP4         20  /* Wake Up Interrupt 4                                    */                                    */
#define NVIC_WAKE_UP5         21  /* Wake Up Interrupt 5                                    */
#define NVIC_WAKE_UP6         22  /* Wake Up Interrupt 6                                    */
#define NVIC_WAKE_UP7         23  /* Wake Up Interrupt 7                                    */
#define NVIC_WAKE_UP8         24  /* Wake Up Interrupt 8                                    */
#define NVIC_WAKE_UP9         25  /* Wake Up Interrupt 9                                    */
#define NVIC_WAKE_UP10        26  /* Wake Up Interrupt 10                                   */
#define NVIC_WAKE_UP11        27  /* Wake Up Interrupt 11                                   */
#define NVIC_I2C0             28  /* I2C SI (state change) Interrupt                        */
#define NVIC_CT16B1           29  /* CT16B1 Match 0-3, Capture 0                            */
#define NVIC_CT16B0           30  /* CT16B0 Match 0-3, Capture 0                            */
#define NVIC_CT32B0           31  /* CT32B0 Match 0-3, Capture 0                            */
#define NVIC_CT32B1           32  /* CT32B1 Match 0-3, Capture 0                            */
#define NVIC_SSP0             33  /* SSP0 Tx FIFO, Rx FIFO,Rx Timeout,Rx Overrun            */
#define NVIC_UART0            34  /* UART0 RLS,THRE, RDA, CTI, ABEO, ABTO, Modem interrupt  */
#define NVIC_UART1            35  /* UART1 RLS,THRE, RDA, CTI, ABEO, ABTO                   */
#define NVIC_CMP              36  /* Comparator 0/1 interrupt                               */
#define NVIC_ADC              37  /* A/D Converter end of conversion                        */
#define NVIC_WDT              38  /* WDT                                                    */
#define NVIC_BOD              39  /* BOD                                                    */
#define NVIC_FLASH            40  /* Flash interrupt                                        */
#define NVIC_PIO_0            41  /* PIO_0                                                  */
#define NVIC_PIO_1            42  /* PIO_1                                                  */
#define NVIC_PIO_2            43  /* PIO_2                                                  */
#define NVIC_PMU              44  /* PMU                                                    */
#define NVIC_DMA              45  /* DMA                                                    */
#define NVIC_RTC              46  /* RTC                                                    */


